Parallelisum.org
#+TITLE:  Parallelisum
#+OPTIONS: num:t
#+STARTUP: overview
#+EXPORT_FILE_NAME: /home/si/Dropbox/LiteraturPrograme/html/Parallelisum.html
#+PROPERTY: header-args :eval no-export
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
* Dependence
#+begin_src
  sudo apt install openmpi-bin
  sudo apt install libopenmpi-dev
#+end_src

* Docker
*** old note
|--------------------------------------------+-----------------|
| comands                                    | expains         |
|--------------------------------------------+-----------------|
| docker images                              | 查看容器        |
| docker pull nginx  [fn:nginx]              | 新增            |
| docker run -d -p 80:80 nginx [fn:docker-v] | 开始，id， 后台 |
| docker exec -it xxxxxx bash                | 前台进入，      |
| docker commit xxxxxx newname               | 生成新容器      |
| docker kill -s KILL xxxxxx                 | 关闭            |
|--------------------------------------------+-----------------|


[fn:nginx] 对于新到手的项目可以直接放到容器的nginx根目录（快速部署 /usr/share/nginx/html），可以在映射的本机端口进入


[fn:docker-v] to my case:
#+begin_src 
sudo docker run -d -p 80:80 -v /home/sx/Documents/Java/ANANProject/layuimini/:/usr/share/nginx/html/ nginx
#+end_src

Beispile
#+begin_src 

sudo docker images
sudo docker pull nginx
sudo docker run -d -p 80:80 nginx -> id:xxxxxxx
sudo docker exec -it -v /....../project:/usr/share/nginx/html xxxxxxx
build in - > local host :80  
#+end_src
*** commands

- docker pull NAME

- docker images
- docker images -a
  
- docker run NAME
- docker run NAME:VERSION
- docker run -d NAME
- docker run -p6000:6379 -d redis
- docker run -p6000:6379 -d  --name redis-older redis

- docker exec -it ID /bin/bash
- docker exec -it NAME /bin/bash

  
- docker ps
- docker ps -a2

- docker start ID
- docker stop ID

- docker logs ID
  
*** discripation
| fast delivery         |
| easy deploy and scale |
| run more workloads    |
| easy management       |
| lightweight image     |
| No guest OS           |

- Disadvanage: can not change kernel
- Less secure than VM

- Docker Registry hold Docker Images
- Docker Images create Docker Container(run as instance)
- Docker Container runs applications
- the shared levels are readonly, and containers communicate with sockets or Restful API
*** delete
- delete docker
docker ps -a  // get dockerid or dockername
docker stop Did/Dname
docker rm Did/Dname
- delete image
  docker images  // get image id or image name
  docker rmi  Iid/Iname
  perhaps some none name image should also be rm
- sudo docker rm $(sudo docker ps -aq)
  
* Singularity
** build [sandbox]
#+begin_src  sh
  build  target source
  source can be singularityfile, dockerhubname, online resource,  sandbox simg file, singularity sif file

  sudo singularity build singularityfile.sif singularityfile
  sudo singularity build singularity.sif docker://dockerhubname


  sudo singularity build --sandbox singularityfile.simg singularityfile
  sudo singularity build --sandbox singularity.simg docker://dockerhubname

  sudo singularity shell  singularityfile.simg
  
  sudo singularity shell --writable singularityfile.simg

  sudo singularity shell --bind /home/silin/go:/home/go  -w --nv centos-7.simg



#+end_src

* C/C++ with OpenMP 
