html/Parallelisum.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-24 Fr 19:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Parallelisum</title>
<meta name="author" content="si" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Parallelisum</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2143c31">1. Dependence</a></li>
<li><a href="#org7c12892">2. Docker</a>
<ul>
<li>
<ul>
<li><a href="#orgd79e655">2.0.1. old note</a></li>
<li><a href="#orgac008ed">2.0.2. commands</a></li>
<li><a href="#org3012367">2.0.3. discripation</a></li>
<li><a href="#org3fbf5f8">2.0.4. delete</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org755e4d8">3. Singularity</a>
<ul>
<li><a href="#org520c5cf">3.1. build [sandbox]</a></li>
</ul>
</li>
<li><a href="#org08d5681">4. C/C++ with OpenMP</a>
<ul>
<li><a href="#orgb88fa30">4.1. src compile config</a></li>
<li><a href="#orga4e6e87">4.2. useful libary functions</a>
<ul>
<li><a href="#org2e054d2">4.2.1. omp<sub>get</sub><sub>thread</sub><sub>num</sub></a></li>
<li><a href="#org2138e5b">4.2.2. omp<sub>get</sub><sub>num</sub><sub>procs</sub></a></li>
<li><a href="#org22d6b24">4.2.3. omp<sub>get</sub><sub>num</sub><sub>threads</sub></a></li>
<li><a href="#org8c3d0af">4.2.4. omp<sub>set</sub><sub>num</sub><sub>threads</sub></a></li>
<li><a href="#orgacd2cab">4.2.5. omp<sub>get</sub><sub>wtime</sub></a></li>
<li><a href="#org19d4160">4.2.6. omp<sub>get</sub><sub>wtick</sub></a></li>
<li><a href="#org09e6f99">4.2.7. omp<sub>init</sub><sub>lock</sub></a></li>
<li><a href="#org4ab5313">4.2.8. omp<sub>get</sub><sub>lock</sub></a></li>
<li><a href="#orga9d14d0">4.2.9. omp<sub>unset</sub><sub>lock</sub></a></li>
<li><a href="#org083a38e">4.2.10. omp<sub>test</sub><sub>lock</sub></a></li>
<li><a href="#orgca4c93e">4.2.11. omp<sub>destroy</sub><sub>lock</sub></a></li>
</ul>
</li>
<li><a href="#org2be4588">4.3. Constructor</a></li>
<li><a href="#orgc11dafc">4.4. Subconstructor</a></li>
<li><a href="#org2fea76a">4.5. hello world</a></li>
<li><a href="#org06645a4">4.6. num<sub>threads</sub></a></li>
<li><a href="#org225a309">4.7. for</a></li>
<li><a href="#orgee2ccbc">4.8. ordered</a></li>
<li><a href="#org0fe17a7">4.9. parallel for</a></li>
<li><a href="#org322e81a">4.10. parallel while</a></li>
<li><a href="#org0000047">4.11. sections and section</a></li>
<li><a href="#org1d025fe">4.12. master</a></li>
<li><a href="#org0a5e30f">4.13. private</a></li>
<li><a href="#org90cd6ef">4.14. firstprivate</a></li>
<li><a href="#orgc414ffa">4.15. lastprivate</a></li>
<li><a href="#org1fed990">4.16. shared</a></li>
<li><a href="#org4157479">4.17. reduction</a></li>
<li><a href="#orgf87376d">4.18. default(shared)</a></li>
<li><a href="#orgb36c2f3">4.19. schedule(static)</a></li>
<li><a href="#orgca5a09a">4.20. schedule(dynamic)</a></li>
<li><a href="#orge55e07b">4.21. schedule(guided)</a></li>
</ul>
</li>
<li><a href="#orgec47bd6">5. C/C++ with mpi</a>
<ul>
<li><a href="#orgf21d093">5.1. src compile config</a></li>
<li><a href="#org2b2e841">5.2. MPI<sub>COMM</sub><sub>WORLD</sub></a></li>
<li><a href="#org86fe48c">5.3. hello world of processor</a></li>
<li><a href="#org81f44a2">5.4. MPI<sub>COMM</sub><sub>CREAT</sub></a></li>
<li><a href="#org8babb00">5.5. AllReduce</a></li>
</ul>
</li>
<li><a href="#org29651c6">6. Python</a>
<ul>
<li><a href="#org6eadadb">6.1. Multi Thread</a>
<ul>
<li><a href="#org8c669fc">6.1.1. pure thread start</a></li>
<li><a href="#org5683a2d">6.1.2. thread class</a></li>
<li><a href="#org6f381a6">6.1.3. thread with Lock</a></li>
</ul>
</li>
<li><a href="#org02f8ae6">6.2. Multi processing</a>
<ul>
<li><a href="#org061bc05">6.2.1. pure multi process start</a></li>
<li><a href="#org0169821">6.2.2. multi process differ from multi threading</a></li>
<li><a href="#org94b41ae">6.2.3. Pool</a></li>
<li><a href="#org7151c3c">6.2.4. map</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge814c19">7. Python with mpi</a>
<ul>
<li><a href="#orga2ee4b1">7.1. send &amp; recv</a></li>
<li><a href="#org189936f">7.2. Send &amp; Recv</a></li>
<li><a href="#org2d3f158">7.3. Bcast</a>
<ul>
<li><a href="#org148fadc">7.3.1. with map bcast</a></li>
<li><a href="#orgff78956">7.3.2. with array Bcast</a></li>
</ul>
</li>
<li><a href="#org451458e">7.4. scatter</a>
<ul>
<li><a href="#orgae4a483">7.4.1. with number</a></li>
<li><a href="#orgac397d2">7.4.2. with array</a></li>
</ul>
</li>
<li><a href="#org04e0bde">7.5. Gather</a>
<ul>
<li><a href="#org216828a">7.5.1. with number gather</a></li>
<li><a href="#org995eea2">7.5.2. with array  Gather</a></li>
</ul>
</li>
<li><a href="#org80c655a">7.6. Dynamic Process Management</a></li>
</ul>
</li>
<li><a href="#org182d4ac">8. Go</a>
<ul>
<li><a href="#orgdf307bd">8.1. go chan</a></li>
</ul>
</li>
<li><a href="#orgbea5845">9. Go with mpi</a>
<ul>
<li><a href="#org7db2aa7">9.1. cpuNum</a></li>
<li><a href="#orga6cb2d7">9.2. IsOn</a></li>
<li><a href="#orge4aac8b">9.3. WorldRank</a></li>
<li><a href="#org9df4292">9.4. WorldSize</a></li>
<li><a href="#org9582fe5">9.5. NewCommunicator</a></li>
<li><a href="#org34b541c">9.6. SendInt32 &amp;&amp; RecvInt32</a></li>
<li><a href="#orgdebdc77">9.7. SendInt32s &amp;&amp; RecvInt32s</a></li>
<li><a href="#org6b47724">9.8. SendString &amp;&amp; RecvString</a></li>
<li><a href="#org68c72b2">9.9. ReduceInt32s</a></li>
<li><a href="#orga6e2d21">9.10. AllreduceInt64s</a></li>
<li><a href="#orge56a0c1">9.11. BcastInt64s</a></li>
<li><a href="#org0235708">9.12. distributed-client</a></li>
<li><a href="#orgf98fcde">9.13. Distributed learning server client</a></li>
<li><a href="#orgc0f9aec">9.14. Distributed learning server client one to one</a></li>
</ul>
</li>
<li><a href="#orgd6b1c26">10. GPGPU</a>
<ul>
<li><a href="#orgd12c5ee">10.1. get variables</a></li>
<li><a href="#orga35db22">10.2. Addition dim 1</a>
<ul>
<li><a href="#orgda847d1">10.2.1. without parallelism</a></li>
<li><a href="#org655fa4b">10.2.2. dim 1, grid 1, block 256 N10000000</a></li>
<li><a href="#orgabaca72">10.2.3. dim 1, grid 1, block 256 N10000000 with time</a></li>
<li><a href="#org321ca78">10.2.4. dim 1, grid N, block 1, (N=256)</a></li>
<li><a href="#org09b5f16">10.2.5. dim 1, grid 1, block N, (N=256)</a></li>
<li><a href="#org2b30a8d">10.2.6. dim 1, grid x, block 256</a></li>
</ul>
</li>
<li><a href="#orgd319af6">10.3. Addition dim 2 arry in GPU</a>
<ul>
<li><a href="#org763ce35">10.3.1. dim 2, grid 1, block NxN for array</a></li>
<li><a href="#org17c5e7d">10.3.2. dim 2, grid 1, block NxN for matrix</a></li>
<li><a href="#org4c398f4">10.3.3. dim 2, grid 1, block NxN for matrix with one dim array</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org2143c31" class="outline-2">
<h2 id="org2143c31"><span class="section-number-2">1.</span> Dependence</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
sudo apt install openmpi-bin
sudo apt install libopenmpi-dev
</pre>
</div>
</div>

<div id="outline-container-org7c12892" class="outline-2">
<h2 id="org7c12892"><span class="section-number-2">2.</span> Docker</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd79e655" class="outline-4">
<h4 id="orgd79e655"><span class="section-number-4">2.0.1.</span> old note</h4>
<div class="outline-text-4" id="text-2-0-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">comands</th>
<th scope="col" class="org-left">expains</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">docker images</td>
<td class="org-left">查看容器</td>
</tr>

<tr>
<td class="org-left">docker pull nginx  <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup></td>
<td class="org-left">新增</td>
</tr>

<tr>
<td class="org-left">docker run -d -p 80:80 nginx <sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup></td>
<td class="org-left">开始，id， 后台</td>
</tr>

<tr>
<td class="org-left">docker exec -it xxxxxx bash</td>
<td class="org-left">前台进入，</td>
</tr>

<tr>
<td class="org-left">docker commit xxxxxx newname</td>
<td class="org-left">生成新容器</td>
</tr>

<tr>
<td class="org-left">docker kill -s KILL xxxxxx</td>
<td class="org-left">关闭</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgac008ed" class="outline-4">
<h4 id="orgac008ed"><span class="section-number-4">2.0.2.</span> commands</h4>
<div class="outline-text-4" id="text-2-0-2">
<ul class="org-ul">
<li>docker pull NAME</li>

<li>docker images</li>
<li>docker images -a</li>

<li>docker run NAME</li>
<li>docker run NAME:VERSION</li>
<li>docker run -d NAME</li>
<li>docker run -p6000:6379 -d redis</li>
<li>docker run -p6000:6379 -d  &#x2013;name redis-older redis</li>

<li>docker exec -it ID /bin/bash</li>
<li>docker exec -it NAME /bin/bash</li>
</ul>


<ul class="org-ul">
<li>docker ps</li>
<li>docker ps -a2</li>

<li>docker start ID</li>
<li>docker stop ID</li>

<li>docker logs ID</li>
</ul>
</div>
</div>

<div id="outline-container-org3012367" class="outline-4">
<h4 id="org3012367"><span class="section-number-4">2.0.3.</span> discripation</h4>
<div class="outline-text-4" id="text-2-0-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">fast delivery</td>
</tr>

<tr>
<td class="org-left">easy deploy and scale</td>
</tr>

<tr>
<td class="org-left">run more workloads</td>
</tr>

<tr>
<td class="org-left">easy management</td>
</tr>

<tr>
<td class="org-left">lightweight image</td>
</tr>

<tr>
<td class="org-left">No guest OS</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Disadvanage: can not change kernel</li>
<li>Less secure than VM</li>

<li>Docker Registry hold Docker Images</li>
<li>Docker Images create Docker Container(run as instance)</li>
<li>Docker Container runs applications</li>
<li>the shared levels are readonly, and containers communicate with sockets or Restful API</li>
</ul>
</div>
</div>
<div id="outline-container-org3fbf5f8" class="outline-4">
<h4 id="org3fbf5f8"><span class="section-number-4">2.0.4.</span> delete</h4>
<div class="outline-text-4" id="text-2-0-4">
<ul class="org-ul">
<li>delete docker</li>
</ul>
<p>
docker ps -a  // get dockerid or dockername
docker stop Did/Dname
docker rm Did/Dname
</p>
<ul class="org-ul">
<li>delete image
docker images  // get image id or image name
docker rmi  Iid/Iname
perhaps some none name image should also be rm</li>
<li>sudo docker rm $(sudo docker ps -aq)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org755e4d8" class="outline-2">
<h2 id="org755e4d8"><span class="section-number-2">3.</span> Singularity</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org520c5cf" class="outline-3">
<h3 id="org520c5cf"><span class="section-number-3">3.1.</span> build [sandbox]</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-sh">build  target source
<span style="color: #4f97d7;">source</span> can be singularityfile, dockerhubname, online resource,  sandbox simg file, singularity sif file

sudo singularity build singularityfile.sif singularityfile
sudo singularity build singularity.sif docker://dockerhubname


sudo singularity build --sandbox singularityfile.simg singularityfile
sudo singularity build --sandbox singularity.simg docker://dockerhubname

sudo singularity shell  singularityfile.simg

sudo singularity shell --writable singularityfile.simg

sudo singularity shell --bind /home/silin/go:/home/go  -w --nv centos-7.simg



</pre>
</div>
</div>
</div>
</div>
