Parallelisum.org
** src compile config
C-h v : org-babel-C-compiler
change gcc to gcc -fopenmp

** useful libary functions
*** omp_get_thread_num
#+begin_src C :results output :exports both 
  int main(int argc, char* argv[])
  {
  #pragma omp parallel
    {
      printf("omp_get_thread_num:  %d\n",  omp_get_thread_num());
    }
  }
#+end_src

#+RESULTS:
: omp_get_thread_num:  0
: omp_get_thread_num:  5
: omp_get_thread_num:  3
: omp_get_thread_num:  2
: omp_get_thread_num:  7
: omp_get_thread_num:  6
: omp_get_thread_num:  4
: omp_get_thread_num:  1
*** omp_get_num_procs
#+begin_src C :results output :exports both 
  int main(int argc, char* argv[])
  {
    printf("omp_get_num_procs:  %d\n",  omp_get_num_procs());
    return 0;
  }
#+end_src

#+RESULTS:
: omp_get_num_procs:  8

*** omp_get_num_threads
#+begin_src C :results output :exports both 
  int main(int argc, char* argv[])
  {
  #pragma omp parallel
    printf("omp_get_num_threads:  %d\n",  omp_get_num_threads());
  #pragma omp parallel
  #pragma omp master
    {
      printf("omp_get_num_threads:  %d\n",  omp_get_num_threads());
    }
    return 0;
  }
#+end_src

#+RESULTS:
: omp_get_num_threads:  8
: omp_get_num_threads:  8
: omp_get_num_threads:  8
: omp_get_num_threads:  8
: omp_get_num_threads:  8
: omp_get_num_threads:  8
: omp_get_num_threads:  8
: omp_get_num_threads:  8
: omp_get_num_threads:  8

*** omp_set_num_threads 
#+begin_src C :results output :exports both
  int main()
  {
    omp_set_num_threads(4);
    printf("%d\n", omp_get_num_threads( ));
  #pragma omp parallel
  #pragma omp master
    {
      printf("%d\n", omp_get_num_threads( ));
    }
  }

#+end_src

#+RESULTS:
: 1
: 4
*** omp_get_wtime
*** omp_get_wtick
*** omp_init_lock
*** omp_get_lock
*** omp_unset_lock
*** omp_test_lock
*** omp_destroy_lock

** Constructor
| parallel          |
| for               |
| parallel for      |
| sections          |
| parallel sections |
| critical          |
| single            |
| barrier           |
| atomic            |
| master            |
| ordered           |
| threadprivate     |

** Subconstructor
| parivate     |
| firstprivate |
| lastprivate  |
| reduce       |
| nowait       |
| num_threads  |
| schedule     |
| shared       |
| ordered      |
| copyprivate  |
| copyin       |
| default      |

** hello world
#+begin_src C :results output :exports both 
  int main(int argc, char* argv[])
  {
  #pragma omp parallel
    {
      printf("Hello world from thread %d\n",  omp_get_thread_num());
    }
  }
#+end_src

#+RESULTS:
: Hello world from thread 0
: Hello world from thread 1
: Hello world from thread 4
: Hello world from thread 3
: Hello world from thread 5
: Hello world from thread 7
: Hello world from thread 6
: Hello world from thread 2

** num_threads
#+begin_src C :results output :exports both 
  int main(int argc, char* argv[])
  {
  #pragma omp parallel num_threads(6)
    {
      printf("omp_get_num_threads:  %d\n",  omp_get_num_threads());
    }
    return 0;
  }
#+end_src

#+RESULTS:
: omp_get_num_threads:  6
: omp_get_num_threads:  6
: omp_get_num_threads:  6
: omp_get_num_threads:  6
: omp_get_num_threads:  6
: omp_get_num_threads:  6

** for
only works in one thread
#+begin_src C :results output :exports both 
  int main(int argc, char* argv[])
  {
    int j = 0;
  #pragma omp  for
    for (j = 0; j < 8; j++){
      printf("j = %d, ThreadID = %d\n", j, omp_get_thread_num());
    }
    return 0;
  }
#+end_src

#+RESULTS:
: j = 0, ThreadID = 0
: j = 1, ThreadID = 0
: j = 2, ThreadID = 0
: j = 3, ThreadID = 0
: j = 4, ThreadID = 0
: j = 5, ThreadID = 0
: j = 6, ThreadID = 0
: j = 7, ThreadID = 0

