html/Parallelisum.html

<div id="outline-container-org08d5681" class="outline-2">
<h2 id="org08d5681"><span class="section-number-2">4.</span> C/C++ with OpenMP</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgb88fa30" class="outline-3">
<h3 id="orgb88fa30"><span class="section-number-3">4.1.</span> src compile config</h3>
<div class="outline-text-3" id="text-4-1">
<p>
C-h v : org-babel-C-compiler
change gcc to gcc -fopenmp
</p>
</div>
</div>

<div id="outline-container-orga4e6e87" class="outline-3">
<h3 id="orga4e6e87"><span class="section-number-3">4.2.</span> useful libary functions</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-org2e054d2" class="outline-4">
<h4 id="org2e054d2"><span class="section-number-4">4.2.1.</span> omp<sub>get</sub><sub>thread</sub><sub>num</sub></h4>
<div class="outline-text-4" id="text-4-2-1">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">argv</span>[])
{
<span style="color: #bc6ec5;">#pragma</span> omp parallel
  {
    printf(<span style="color: #2d9574;">"omp_get_thread_num:  %d\n"</span>,  omp_get_thread_num());
  }
}
</pre>
</div>

<pre class="example">
omp_get_thread_num:  0
omp_get_thread_num:  5
omp_get_thread_num:  3
omp_get_thread_num:  2
omp_get_thread_num:  7
omp_get_thread_num:  6
omp_get_thread_num:  4
omp_get_thread_num:  1
</pre>
</div>
</div>
<div id="outline-container-org2138e5b" class="outline-4">
<h4 id="org2138e5b"><span class="section-number-4">4.2.2.</span> omp<sub>get</sub><sub>num</sub><sub>procs</sub></h4>
<div class="outline-text-4" id="text-4-2-2">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">argv</span>[])
{
  printf(<span style="color: #2d9574;">"omp_get_num_procs:  %d\n"</span>,  omp_get_num_procs());
  <span style="color: #4f97d7; font-weight: bold;">return</span> 0;
}
</pre>
</div>

<pre class="example">
omp_get_num_procs:  8
</pre>
</div>
</div>

<div id="outline-container-org22d6b24" class="outline-4">
<h4 id="org22d6b24"><span class="section-number-4">4.2.3.</span> omp<sub>get</sub><sub>num</sub><sub>threads</sub></h4>
<div class="outline-text-4" id="text-4-2-3">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">argv</span>[])
{
<span style="color: #bc6ec5;">#pragma</span> omp parallel
  printf(<span style="color: #2d9574;">"omp_get_num_threads:  %d\n"</span>,  omp_get_num_threads());
<span style="color: #bc6ec5;">#pragma</span> omp parallel
<span style="color: #bc6ec5;">#pragma</span> omp master
  {
    printf(<span style="color: #2d9574;">"omp_get_num_threads:  %d\n"</span>,  omp_get_num_threads());
  }
  <span style="color: #4f97d7; font-weight: bold;">return</span> 0;
}
</pre>
</div>

<pre class="example">
omp_get_num_threads:  8
omp_get_num_threads:  8
omp_get_num_threads:  8
omp_get_num_threads:  8
omp_get_num_threads:  8
omp_get_num_threads:  8
omp_get_num_threads:  8
omp_get_num_threads:  8
omp_get_num_threads:  8
</pre>
</div>
</div>

<div id="outline-container-org8c3d0af" class="outline-4">
<h4 id="org8c3d0af"><span class="section-number-4">4.2.4.</span> omp<sub>set</sub><sub>num</sub><sub>threads</sub></h4>
<div class="outline-text-4" id="text-4-2-4">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>()
{
  omp_set_num_threads(4);
  printf(<span style="color: #2d9574;">"%d\n"</span>, omp_get_num_threads( ));
<span style="color: #bc6ec5;">#pragma</span> omp parallel
<span style="color: #bc6ec5;">#pragma</span> omp master
  {
    printf(<span style="color: #2d9574;">"%d\n"</span>, omp_get_num_threads( ));
  }
}

</pre>
</div>

<pre class="example">
1
4
</pre>
</div>
</div>
<div id="outline-container-orgacd2cab" class="outline-4">
<h4 id="orgacd2cab"><span class="section-number-4">4.2.5.</span> omp<sub>get</sub><sub>wtime</sub></h4>
</div>
<div id="outline-container-org19d4160" class="outline-4">
<h4 id="org19d4160"><span class="section-number-4">4.2.6.</span> omp<sub>get</sub><sub>wtick</sub></h4>
</div>
<div id="outline-container-org09e6f99" class="outline-4">
<h4 id="org09e6f99"><span class="section-number-4">4.2.7.</span> omp<sub>init</sub><sub>lock</sub></h4>
</div>
<div id="outline-container-org4ab5313" class="outline-4">
<h4 id="org4ab5313"><span class="section-number-4">4.2.8.</span> omp<sub>get</sub><sub>lock</sub></h4>
</div>
<div id="outline-container-orga9d14d0" class="outline-4">
<h4 id="orga9d14d0"><span class="section-number-4">4.2.9.</span> omp<sub>unset</sub><sub>lock</sub></h4>
</div>
<div id="outline-container-org083a38e" class="outline-4">
<h4 id="org083a38e"><span class="section-number-4">4.2.10.</span> omp<sub>test</sub><sub>lock</sub></h4>
</div>
<div id="outline-container-orgca4c93e" class="outline-4">
<h4 id="orgca4c93e"><span class="section-number-4">4.2.11.</span> omp<sub>destroy</sub><sub>lock</sub></h4>
</div>
</div>

<div id="outline-container-org2be4588" class="outline-3">
<h3 id="org2be4588"><span class="section-number-3">4.3.</span> Constructor</h3>
<div class="outline-text-3" id="text-4-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">parallel</td>
</tr>

<tr>
<td class="org-left">for</td>
</tr>

<tr>
<td class="org-left">parallel for</td>
</tr>

<tr>
<td class="org-left">sections</td>
</tr>

<tr>
<td class="org-left">parallel sections</td>
</tr>

<tr>
<td class="org-left">critical</td>
</tr>

<tr>
<td class="org-left">single</td>
</tr>

<tr>
<td class="org-left">barrier</td>
</tr>

<tr>
<td class="org-left">atomic</td>
</tr>

<tr>
<td class="org-left">master</td>
</tr>

<tr>
<td class="org-left">ordered</td>
</tr>

<tr>
<td class="org-left">threadprivate</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgc11dafc" class="outline-3">
<h3 id="orgc11dafc"><span class="section-number-3">4.4.</span> Subconstructor</h3>
<div class="outline-text-3" id="text-4-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">parivate</td>
</tr>

<tr>
<td class="org-left">firstprivate</td>
</tr>

<tr>
<td class="org-left">lastprivate</td>
</tr>

<tr>
<td class="org-left">reduce</td>
</tr>

<tr>
<td class="org-left">nowait</td>
</tr>

<tr>
<td class="org-left">num<sub>threads</sub></td>
</tr>

<tr>
<td class="org-left">schedule</td>
</tr>

<tr>
<td class="org-left">shared</td>
</tr>

<tr>
<td class="org-left">ordered</td>
</tr>

<tr>
<td class="org-left">copyprivate</td>
</tr>

<tr>
<td class="org-left">copyin</td>
</tr>

<tr>
<td class="org-left">default</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org2fea76a" class="outline-3">
<h3 id="org2fea76a"><span class="section-number-3">4.5.</span> hello world</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">argv</span>[])
{
<span style="color: #bc6ec5;">#pragma</span> omp parallel
  {
    printf(<span style="color: #2d9574;">"Hello world from thread %d\n"</span>,  omp_get_thread_num());
  }
}
</pre>
</div>

<pre class="example">
Hello world from thread 0
Hello world from thread 1
Hello world from thread 4
Hello world from thread 3
Hello world from thread 5
Hello world from thread 7
Hello world from thread 6
Hello world from thread 2
</pre>
</div>
</div>

<div id="outline-container-org06645a4" class="outline-3">
<h3 id="org06645a4"><span class="section-number-3">4.6.</span> num<sub>threads</sub></h3>
<div class="outline-text-3" id="text-4-6">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">argv</span>[])
{
<span style="color: #bc6ec5;">#pragma</span> omp parallel num_threads(6)
  {
    printf(<span style="color: #2d9574;">"omp_get_num_threads:  %d\n"</span>,  omp_get_num_threads());
  }
  <span style="color: #4f97d7; font-weight: bold;">return</span> 0;
}
</pre>
</div>

<pre class="example">
omp_get_num_threads:  6
omp_get_num_threads:  6
omp_get_num_threads:  6
omp_get_num_threads:  6
omp_get_num_threads:  6
omp_get_num_threads:  6
</pre>
</div>
</div>

<div id="outline-container-org225a309" class="outline-3">
<h3 id="org225a309"><span class="section-number-3">4.7.</span> for</h3>
<div class="outline-text-3" id="text-4-7">
<p>
only works in one thread
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">argv</span>[])
{
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">j</span> = 0;
<span style="color: #bc6ec5;">#pragma</span> omp  <span style="color: #4f97d7; font-weight: bold;">for</span>
  <span style="color: #4f97d7; font-weight: bold;">for</span> (j = 0; j &lt; 8; j++){
    printf(<span style="color: #2d9574;">"j = %d, ThreadID = %d\n"</span>, j, omp_get_thread_num());
  }
  <span style="color: #4f97d7; font-weight: bold;">return</span> 0;
}
</pre>
</div>

<pre class="example">
j = 0, ThreadID = 0
j = 1, ThreadID = 0
j = 2, ThreadID = 0
j = 3, ThreadID = 0
j = 4, ThreadID = 0
j = 5, ThreadID = 0
j = 6, ThreadID = 0
j = 7, ThreadID = 0
</pre>
</div>
</div>
