Parallelisum.org
** ordered
#+begin_src C :results output :exports both
  int main(int argc, char* argv[])
  {
    int j = 0;
  #pragma omp parallel for ordered
    for (j = 0; j < 2; j++){
  #pragma omp ordered
      {
        printf("01 ordered j = %d, ThreadID = %d\n", j, omp_get_thread_num());
      }
  #pragma omp ordered
      {
        printf("02 ordered j = %d, ThreadID = %d\n", j, omp_get_thread_num());
      }
  #pragma omp ordered
      {
        printf("03 ordered j = %d, ThreadID = %d\n", j, omp_get_thread_num());
      }
    }
    return 0;
  }
#+end_src

#+RESULTS:
: 01 ordered j = 0, ThreadID = 0
: 02 ordered j = 0, ThreadID = 0
: 03 ordered j = 0, ThreadID = 0
: 01 ordered j = 1, ThreadID = 1
: 02 ordered j = 1, ThreadID = 1
: 03 ordered j = 1, ThreadID = 1

** parallel for
for should work with parallel
#+begin_src C :results output :exports both
  int main(int argc, char* argv[])
  {
    int j = 0;
  #pragma omp parallel for
    for (j = 0; j < 8; j++){
      printf("j = %d, ThreadID = %d\n", j, omp_get_thread_num());
    }
    return 0;
  }
#+end_src

#+RESULTS:
: j = 0, ThreadID = 0
: j = 1, ThreadID = 1
: j = 2, ThreadID = 2
: j = 6, ThreadID = 6
: j = 5, ThreadID = 5
: j = 7, ThreadID = 7
: j = 3, ThreadID = 3
: j = 4, ThreadID = 4

#+begin_src C :results output :exports both
  int main(int argc, char* argv[])
  {
    int j = 0;
  #pragma omp parallel  for
    for (j = 0; j < 8; j++){
      printf("j = %d, ThreadID = %d\n", j, omp_get_thread_num());
    }
    return 0;
  }
#+end_src

#+RESULTS:
: j = 7, ThreadID = 7
: j = 3, ThreadID = 3
: j = 6, ThreadID = 6
: j = 2, ThreadID = 2
: j = 4, ThreadID = 4
: j = 0, ThreadID = 0
: j = 1, ThreadID = 1
: j = 5, ThreadID = 5



and this can be rewrite as following, for in parallel, but can be multiple for block
#+begin_src C :results output :exports both
  int main(int argc, char* argv[])
  {
    int j = 0;
  #pragma omp parallel num_threads(4)
    //   #pragma omp parallel  // EQUAL TO   #pragma omp parallel num_threads(8)
    {
  #pragma omp  for
      for (j = 0; j <8; j++)
        {
          printf("j = %d, ThreadID = %d\n", j, omp_get_thread_num());
        }
    }
    return 0;
  }
#+end_src

#+RESULTS:
: j = 0, ThreadID = 0
: j = 1, ThreadID = 0
: j = 6, ThreadID = 3
: j = 7, ThreadID = 3
: j = 2, ThreadID = 1
: j = 3, ThreadID = 1
: j = 4, ThreadID = 2
: j = 5, ThreadID = 2

** parallel while
for should work with parallel
#+begin_src C :results output :exports both
  int main(int argc, char* argv[])
  {
    int j = 0;
  #pragma omp parallel num_threads(8) shared(j)
    while (j < 8){
      printf("j = %d, ThreadID = %d\n", j, omp_get_thread_num());
      j++;
    }
    return 0;
  }
#+end_src

#+RESULTS:
#+begin_example
j = 0, ThreadID = 0
j = 0, ThreadID = 7
j = 0, ThreadID = 3
j = 2, ThreadID = 3
j = 3, ThreadID = 3
j = 4, ThreadID = 3
j = 5, ThreadID = 3
j = 6, ThreadID = 3
j = 7, ThreadID = 3
j = 0, ThreadID = 6
j = 0, ThreadID = 4
j = 0, ThreadID = 1
j = 0, ThreadID = 5
j = 1, ThreadID = 0
j = 0, ThreadID = 2
#+end_example

** sections and section
#+begin_src C :results output :exports both
  void main(int argc, char *argv)
  {
  #pragma omp parallel sections
    {
  #pragma omp section
      printf("section 1 ThreadId = %d\n", omp_get_thread_num());
  #pragma omp section
      printf("section 2 ThreadId = %d\n", omp_get_thread_num());
  #pragma omp section
      printf("section 3 ThreadId = %d\n", omp_get_thread_num());
  #pragma omp section
      printf("section 4 ThreadId = %d\n", omp_get_thread_num());
    }
  }
#+end_src

#+RESULTS:
: section 4 ThreadId = 0
: section 3 ThreadId = 5
: section 2 ThreadId = 3
: section 1 ThreadId = 6

another form, parallel and sections can also be separated, and with mulitple sections block
but each sections are not paralleled, but concatenated
#+begin_src C :results output :exports both
  void main(int argc, char *argv)
  {
  #pragma omp parallel
    {
  #pragma omp sections
      {
  #pragma omp section
        printf("section 1 ThreadId = %d\n", omp_get_thread_num());
  #pragma omp section
        printf("section 2 ThreadId = %d\n", omp_get_thread_num());
  #pragma omp section
        printf("section 3 ThreadId = %d\n", omp_get_thread_num());
      }
  #pragma omp sections
      {
  #pragma omp section
        printf("section 1 ThreadId = %d\n", omp_get_thread_num());
  #pragma omp section
        printf("section 2 ThreadId = %d\n", omp_get_thread_num());
  #pragma omp section
        printf("section 3 ThreadId = %d\n", omp_get_thread_num());
      }
    }
  }
#+end_src

#+RESULTS:
: section 1 ThreadId = 3
: section 2 ThreadId = 0
: section 3 ThreadId = 4
: section 2 ThreadId = 0
: section 1 ThreadId = 1
: section 3 ThreadId = 6

