html/Parallelisum.html

<div id="outline-container-orgee2ccbc" class="outline-3">
<h3 id="orgee2ccbc"><span class="section-number-3">4.8.</span> ordered</h3>
<div class="outline-text-3" id="text-4-8">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">argv</span>[])
{
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">j</span> = 0;
<span style="color: #bc6ec5;">#pragma</span> omp parallel <span style="color: #4f97d7; font-weight: bold;">for</span> ordered
  <span style="color: #4f97d7; font-weight: bold;">for</span> (j = 0; j &lt; 2; j++){
<span style="color: #bc6ec5;">#pragma</span> omp ordered
    {
      printf(<span style="color: #2d9574;">"01 ordered j = %d, ThreadID = %d\n"</span>, j, omp_get_thread_num());
    }
<span style="color: #bc6ec5;">#pragma</span> omp ordered
    {
      printf(<span style="color: #2d9574;">"02 ordered j = %d, ThreadID = %d\n"</span>, j, omp_get_thread_num());
    }
<span style="color: #bc6ec5;">#pragma</span> omp ordered
    {
      printf(<span style="color: #2d9574;">"03 ordered j = %d, ThreadID = %d\n"</span>, j, omp_get_thread_num());
    }
  }
  <span style="color: #4f97d7; font-weight: bold;">return</span> 0;
}
</pre>
</div>

<pre class="example">
01 ordered j = 0, ThreadID = 0
02 ordered j = 0, ThreadID = 0
03 ordered j = 0, ThreadID = 0
01 ordered j = 1, ThreadID = 1
02 ordered j = 1, ThreadID = 1
03 ordered j = 1, ThreadID = 1
</pre>
</div>
</div>

<div id="outline-container-org0fe17a7" class="outline-3">
<h3 id="org0fe17a7"><span class="section-number-3">4.9.</span> parallel for</h3>
<div class="outline-text-3" id="text-4-9">
<p>
for should work with parallel
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">argv</span>[])
{
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">j</span> = 0;
<span style="color: #bc6ec5;">#pragma</span> omp parallel <span style="color: #4f97d7; font-weight: bold;">for</span>
  <span style="color: #4f97d7; font-weight: bold;">for</span> (j = 0; j &lt; 8; j++){
    printf(<span style="color: #2d9574;">"j = %d, ThreadID = %d\n"</span>, j, omp_get_thread_num());
  }
  <span style="color: #4f97d7; font-weight: bold;">return</span> 0;
}
</pre>
</div>

<pre class="example">
j = 0, ThreadID = 0
j = 1, ThreadID = 1
j = 2, ThreadID = 2
j = 6, ThreadID = 6
j = 5, ThreadID = 5
j = 7, ThreadID = 7
j = 3, ThreadID = 3
j = 4, ThreadID = 4
</pre>


<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">argv</span>[])
{
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">j</span> = 0;
<span style="color: #bc6ec5;">#pragma</span> omp parallel  <span style="color: #4f97d7; font-weight: bold;">for</span>
  <span style="color: #4f97d7; font-weight: bold;">for</span> (j = 0; j &lt; 8; j++){
    printf(<span style="color: #2d9574;">"j = %d, ThreadID = %d\n"</span>, j, omp_get_thread_num());
  }
  <span style="color: #4f97d7; font-weight: bold;">return</span> 0;
}
</pre>
</div>

<pre class="example">
j = 7, ThreadID = 7
j = 3, ThreadID = 3
j = 6, ThreadID = 6
j = 2, ThreadID = 2
j = 4, ThreadID = 4
j = 0, ThreadID = 0
j = 1, ThreadID = 1
j = 5, ThreadID = 5
</pre>




<p>
and this can be rewrite as following, for in parallel, but can be multiple for block
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">argv</span>[])
{
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">j</span> = 0;
<span style="color: #bc6ec5;">#pragma</span> omp parallel num_threads(4)
  <span style="color: #2aa1ae; background-color: #292e34;">//   </span><span style="color: #2aa1ae; background-color: #292e34;">#pragma omp parallel  // EQUAL TO   #pragma omp parallel num_threads(8)</span>
  {
<span style="color: #bc6ec5;">#pragma</span> omp  <span style="color: #4f97d7; font-weight: bold;">for</span>
    <span style="color: #4f97d7; font-weight: bold;">for</span> (j = 0; j &lt;8; j++)
      {
        printf(<span style="color: #2d9574;">"j = %d, ThreadID = %d\n"</span>, j, omp_get_thread_num());
      }
  }
  <span style="color: #4f97d7; font-weight: bold;">return</span> 0;
}
</pre>
</div>

<pre class="example">
j = 0, ThreadID = 0
j = 1, ThreadID = 0
j = 6, ThreadID = 3
j = 7, ThreadID = 3
j = 2, ThreadID = 1
j = 3, ThreadID = 1
j = 4, ThreadID = 2
j = 5, ThreadID = 2
</pre>
</div>
</div>

<div id="outline-container-org322e81a" class="outline-3">
<h3 id="org322e81a"><span class="section-number-3">4.10.</span> parallel while</h3>
<div class="outline-text-3" id="text-4-10">
<p>
for should work with parallel
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">argv</span>[])
{
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">j</span> = 0;
<span style="color: #bc6ec5;">#pragma</span> omp parallel num_threads(8) shared(j)
  <span style="color: #4f97d7; font-weight: bold;">while</span> (j &lt; 8){
    printf(<span style="color: #2d9574;">"j = %d, ThreadID = %d\n"</span>, j, omp_get_thread_num());
    j++;
  }
  <span style="color: #4f97d7; font-weight: bold;">return</span> 0;
}
</pre>
</div>

<pre class="example" id="orgb40b035">
j = 0, ThreadID = 0
j = 0, ThreadID = 7
j = 0, ThreadID = 3
j = 2, ThreadID = 3
j = 3, ThreadID = 3
j = 4, ThreadID = 3
j = 5, ThreadID = 3
j = 6, ThreadID = 3
j = 7, ThreadID = 3
j = 0, ThreadID = 6
j = 0, ThreadID = 4
j = 0, ThreadID = 1
j = 0, ThreadID = 5
j = 1, ThreadID = 0
j = 0, ThreadID = 2
</pre>
</div>
</div>

<div id="outline-container-org0000047" class="outline-3">
<h3 id="org0000047"><span class="section-number-3">4.11.</span> sections and section</h3>
<div class="outline-text-3" id="text-4-11">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span>)
{
<span style="color: #bc6ec5;">#pragma</span> omp parallel sections
  {
<span style="color: #bc6ec5;">#pragma</span> omp section
    printf(<span style="color: #2d9574;">"section 1 ThreadId = %d\n"</span>, omp_get_thread_num());
<span style="color: #bc6ec5;">#pragma</span> omp section
    printf(<span style="color: #2d9574;">"section 2 ThreadId = %d\n"</span>, omp_get_thread_num());
<span style="color: #bc6ec5;">#pragma</span> omp section
    printf(<span style="color: #2d9574;">"section 3 ThreadId = %d\n"</span>, omp_get_thread_num());
<span style="color: #bc6ec5;">#pragma</span> omp section
    printf(<span style="color: #2d9574;">"section 4 ThreadId = %d\n"</span>, omp_get_thread_num());
  }
}
</pre>
</div>

<pre class="example">
section 4 ThreadId = 0
section 3 ThreadId = 5
section 2 ThreadId = 3
section 1 ThreadId = 6
</pre>


<p>
another form, parallel and sections can also be separated, and with mulitple sections block
but each sections are not paralleled, but concatenated
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span>)
{
<span style="color: #bc6ec5;">#pragma</span> omp parallel
  {
<span style="color: #bc6ec5;">#pragma</span> omp sections
    {
<span style="color: #bc6ec5;">#pragma</span> omp section
      printf(<span style="color: #2d9574;">"section 1 ThreadId = %d\n"</span>, omp_get_thread_num());
<span style="color: #bc6ec5;">#pragma</span> omp section
      printf(<span style="color: #2d9574;">"section 2 ThreadId = %d\n"</span>, omp_get_thread_num());
<span style="color: #bc6ec5;">#pragma</span> omp section
      printf(<span style="color: #2d9574;">"section 3 ThreadId = %d\n"</span>, omp_get_thread_num());
    }
<span style="color: #bc6ec5;">#pragma</span> omp sections
    {
<span style="color: #bc6ec5;">#pragma</span> omp section
      printf(<span style="color: #2d9574;">"section 1 ThreadId = %d\n"</span>, omp_get_thread_num());
<span style="color: #bc6ec5;">#pragma</span> omp section
      printf(<span style="color: #2d9574;">"section 2 ThreadId = %d\n"</span>, omp_get_thread_num());
<span style="color: #bc6ec5;">#pragma</span> omp section
      printf(<span style="color: #2d9574;">"section 3 ThreadId = %d\n"</span>, omp_get_thread_num());
    }
  }
}
</pre>
</div>

<pre class="example">
section 1 ThreadId = 3
section 2 ThreadId = 0
section 3 ThreadId = 4
section 2 ThreadId = 0
section 1 ThreadId = 1
section 3 ThreadId = 6
</pre>
</div>
</div>
