Parallelisum.org
** master
#+begin_src C :results output :exports both
  void main(int argc, char *argv)
  {
  #pragma omp parallel 
  #pragma omp master
    {
      printf("I am the master\n");
    }
  }
#+end_src

#+RESULTS:
: I am the master

** private
after the block of private for,  there are some wired to execute some out of parallelisum
#+begin_src C :results output :exports both
  void main(int argc, char *argv)
  {
    int k = 100;
  #pragma omp parallel for private(k)
    for ( k=0; k < 8; k++)
      {
        printf("k=%d\n", k);
      }
    printf("kkk = %d\n", k);
  #pragma omp parallel sections
    {
  #pragma omp section
      printf("kkk = %d\n", k);
    }
  }
#+end_src

#+RESULTS:
#+begin_example
k=6
k=7
k=3
k=2
k=0
k=4
k=5
k=1
kkk = 100
kkk = 100
#+end_example


** firstprivate
take the vaiable to Parallelisum, but not influence back
#+begin_src C :results output :exports both
  void main(int argc, char *argv)
  {
    int k = 100;
  #pragma omp parallel for firstprivate(k)
    for (int i=0; i < 8; i++)
      {
        k += i;
        printf("k=%d\n", k);
      }
    printf("k out of parall = %d\n", k);
  }
#+end_src

#+RESULTS:
: k=103
: k=107
: k=100
: k=104
: k=106
: k=102
: k=105
: k=101
: k out of parall = 100

** lastprivate
take the vaiable to Parallelisum, and influence back
#+begin_src C :results output :exports both
  void main(int argc, char *argv)
  {
    int k = 100;
  #pragma omp parallel for firstprivate(k) lastprivate(k)
    for (int i=0; i < 8; i++)
      {
        k += i;
        printf("k=%d\n", k);
      }
    printf("k out of parall = %d\n", k);
  }
#+end_src

#+RESULTS:
: k=100
: k=107
: k=106
: k=102
: k=101
: k=105
: k=103
: k=104
: k out of parall = 107

** shared
#+begin_src C :results output :exports both
  void main(int argc, char *argv)
  {
    int k = 100;
    int i = 1;
  #pragma omp parallel for shared(k)
    for ( i=0; i < 8; i++)
      {
        printf("k=%d\n", k);
      }
  }
#+end_src

#+RESULTS:
: k=100
: k=100
: k=100
: k=100
: k=100
: k=100
: k=100
: k=100
: k = 100

** reduction
#+begin_src C :results output :exports both
  void main(int argc, char *argv)
  {
    int sum = 0;
    int i = 0;
  #pragma omp parallel for reduction(+:sum)
    for ( i=0; i < 10; i++)
      {
        printf("omp_get_thread_num:  %d\n",  omp_get_thread_num());
        sum += i;
      }
    printf("sum is %d\n", sum);
  }
#+end_src

#+RESULTS:
#+begin_example
omp_get_thread_num:  0
omp_get_thread_num:  0
omp_get_thread_num:  1
omp_get_thread_num:  1
omp_get_thread_num:  7
omp_get_thread_num:  2
omp_get_thread_num:  5
omp_get_thread_num:  4
omp_get_thread_num:  6
omp_get_thread_num:  3
sum is 45
#+end_example

#+begin_src C :results output :exports both
  void main(int argc, char *argv)
  {
    int sum = 0;
    int i = 10;
  #pragma omp parallel reduction(+:sum)
    {
      printf("omp_get_thread_num:  %d\n",  omp_get_thread_num());
      sum += i;
    }
    printf("sum is %d\n", sum);
  }
#+end_src

#+RESULTS:
: omp_get_thread_num:  0
: omp_get_thread_num:  3
: omp_get_thread_num:  4
: omp_get_thread_num:  2
: omp_get_thread_num:  7
: omp_get_thread_num:  6
: omp_get_thread_num:  5
: omp_get_thread_num:  1
: sum is 80

** default(shared)
#+begin_src C :results output :exports both
  void main(int argc, char *argv)
  {
    int k = 100;
    int i = 1;
  #pragma omp parallel for default(shared)
    for ( i=0; i < 8; i++)
      {
        printf("k=%d\n", k);
      }
  }
#+end_src

#+RESULTS:
: k=100
: k=100
: k=100
: k=100
: k=100
: k=100
: k=100
: k=100
: i=1
