html/Parallelisum.html

<div id="outline-container-org1d025fe" class="outline-3">
<h3 id="org1d025fe"><span class="section-number-3">4.12.</span> master</h3>
<div class="outline-text-3" id="text-4-12">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span>)
{
<span style="color: #bc6ec5;">#pragma</span> omp parallel 
<span style="color: #bc6ec5;">#pragma</span> omp master
  {
    printf(<span style="color: #2d9574;">"I am the master\n"</span>);
  }
}
</pre>
</div>

<pre class="example">
I am the master
</pre>
</div>
</div>

<div id="outline-container-org0a5e30f" class="outline-3">
<h3 id="org0a5e30f"><span class="section-number-3">4.13.</span> private</h3>
<div class="outline-text-3" id="text-4-13">
<p>
after the block of private for,  there are some wired to execute some out of parallelisum
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span>)
{
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">k</span> = 100;
<span style="color: #bc6ec5;">#pragma</span> omp parallel <span style="color: #4f97d7; font-weight: bold;">for</span> private(k)
  <span style="color: #4f97d7; font-weight: bold;">for</span> ( k=0; k &lt; 8; k++)
    {
      printf(<span style="color: #2d9574;">"k=%d\n"</span>, k);
    }
  printf(<span style="color: #2d9574;">"kkk = %d\n"</span>, k);
<span style="color: #bc6ec5;">#pragma</span> omp parallel sections
  {
<span style="color: #bc6ec5;">#pragma</span> omp section
    printf(<span style="color: #2d9574;">"kkk = %d\n"</span>, k);
  }
}
</pre>
</div>

<pre class="example" id="orgde13983">
k=6
k=7
k=3
k=2
k=0
k=4
k=5
k=1
kkk = 100
kkk = 100
</pre>
</div>
</div>


<div id="outline-container-org90cd6ef" class="outline-3">
<h3 id="org90cd6ef"><span class="section-number-3">4.14.</span> firstprivate</h3>
<div class="outline-text-3" id="text-4-14">
<p>
take the vaiable to Parallelisum, but not influence back
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span>)
{
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">k</span> = 100;
<span style="color: #bc6ec5;">#pragma</span> omp parallel <span style="color: #4f97d7; font-weight: bold;">for</span> firstprivate(k)
  <span style="color: #4f97d7; font-weight: bold;">for</span> (<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>=0; i &lt; 8; i++)
    {
      k += i;
      printf(<span style="color: #2d9574;">"k=%d\n"</span>, k);
    }
  printf(<span style="color: #2d9574;">"k out of parall = %d\n"</span>, k);
}
</pre>
</div>

<pre class="example">
k=103
k=107
k=100
k=104
k=106
k=102
k=105
k=101
k out of parall = 100
</pre>
</div>
</div>

<div id="outline-container-orgc414ffa" class="outline-3">
<h3 id="orgc414ffa"><span class="section-number-3">4.15.</span> lastprivate</h3>
<div class="outline-text-3" id="text-4-15">
<p>
take the vaiable to Parallelisum, and influence back
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span>)
{
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">k</span> = 100;
<span style="color: #bc6ec5;">#pragma</span> omp parallel <span style="color: #4f97d7; font-weight: bold;">for</span> firstprivate(k) lastprivate(k)
  <span style="color: #4f97d7; font-weight: bold;">for</span> (<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>=0; i &lt; 8; i++)
    {
      k += i;
      printf(<span style="color: #2d9574;">"k=%d\n"</span>, k);
    }
  printf(<span style="color: #2d9574;">"k out of parall = %d\n"</span>, k);
}
</pre>
</div>

<pre class="example">
k=100
k=107
k=106
k=102
k=101
k=105
k=103
k=104
k out of parall = 107
</pre>
</div>
</div>

<div id="outline-container-org1fed990" class="outline-3">
<h3 id="org1fed990"><span class="section-number-3">4.16.</span> shared</h3>
<div class="outline-text-3" id="text-4-16">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span>)
{
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">k</span> = 100;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = 1;
<span style="color: #bc6ec5;">#pragma</span> omp parallel <span style="color: #4f97d7; font-weight: bold;">for</span> shared(k)
  <span style="color: #4f97d7; font-weight: bold;">for</span> ( i=0; i &lt; 8; i++)
    {
      printf(<span style="color: #2d9574;">"k=%d\n"</span>, k);
    }
}
</pre>
</div>

<pre class="example">
k=100
k=100
k=100
k=100
k=100
k=100
k=100
k=100
k = 100
</pre>
</div>
</div>

<div id="outline-container-org4157479" class="outline-3">
<h3 id="org4157479"><span class="section-number-3">4.17.</span> reduction</h3>
<div class="outline-text-3" id="text-4-17">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span>)
{
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">sum</span> = 0;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = 0;
<span style="color: #bc6ec5;">#pragma</span> omp parallel <span style="color: #4f97d7; font-weight: bold;">for</span> reduction(+:sum)
  <span style="color: #4f97d7; font-weight: bold;">for</span> ( i=0; i &lt; 10; i++)
    {
      printf(<span style="color: #2d9574;">"omp_get_thread_num:  %d\n"</span>,  omp_get_thread_num());
      sum += i;
    }
  printf(<span style="color: #2d9574;">"sum is %d\n"</span>, sum);
}
</pre>
</div>

<pre class="example" id="org9944124">
omp_get_thread_num:  0
omp_get_thread_num:  0
omp_get_thread_num:  1
omp_get_thread_num:  1
omp_get_thread_num:  7
omp_get_thread_num:  2
omp_get_thread_num:  5
omp_get_thread_num:  4
omp_get_thread_num:  6
omp_get_thread_num:  3
sum is 45
</pre>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span>)
{
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">sum</span> = 0;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = 10;
<span style="color: #bc6ec5;">#pragma</span> omp parallel reduction(+:sum)
  {
    printf(<span style="color: #2d9574;">"omp_get_thread_num:  %d\n"</span>,  omp_get_thread_num());
    sum += i;
  }
  printf(<span style="color: #2d9574;">"sum is %d\n"</span>, sum);
}
</pre>
</div>

<pre class="example">
omp_get_thread_num:  0
omp_get_thread_num:  3
omp_get_thread_num:  4
omp_get_thread_num:  2
omp_get_thread_num:  7
omp_get_thread_num:  6
omp_get_thread_num:  5
omp_get_thread_num:  1
sum is 80
</pre>
</div>
</div>

<div id="outline-container-orgf87376d" class="outline-3">
<h3 id="orgf87376d"><span class="section-number-3">4.18.</span> default(shared)</h3>
<div class="outline-text-3" id="text-4-18">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span>)
{
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">k</span> = 100;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = 1;
<span style="color: #bc6ec5;">#pragma</span> omp parallel <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #4f97d7; font-weight: bold;">default</span>(shared)
  <span style="color: #4f97d7; font-weight: bold;">for</span> ( i=0; i &lt; 8; i++)
    {
      printf(<span style="color: #2d9574;">"k=%d\n"</span>, k);
    }
}
</pre>
</div>

<pre class="example">
k=100
k=100
k=100
k=100
k=100
k=100
k=100
k=100
i=1
</pre>
</div>
</div>
