Parallelisum.org
** schedule(static)
all iterations will be equally divied to each thread
schedule(static, size): size time iterations will be drived  each time
#+begin_src C :results output :exports both
  void main(int argc, char *argv)
  {
    int i = 0;
  #pragma omp parallel for schedule(static)
    for (i = 0; i < 24 ; i++)
      {
        printf("i=%d, thread_id=%d\n", i, omp_get_thread_num());
      }
  }
#+end_src

#+RESULTS:
#+begin_example
i=0, thread_id=0
i=14, thread_id=7
i=15, thread_id=7
i=2, thread_id=1
i=12, thread_id=6
i=3, thread_id=1
i=18, thread_id=1
i=8, thread_id=4
i=10, thread_id=5
i=19, thread_id=1
i=9, thread_id=4
i=1, thread_id=0
i=11, thread_id=5
i=16, thread_id=0
i=13, thread_id=6
i=4, thread_id=2
i=6, thread_id=3
i=7, thread_id=3
i=22, thread_id=3
i=23, thread_id=3
i=17, thread_id=0
i=5, thread_id=2
i=20, thread_id=2
i=21, thread_id=2
#+end_example

** schedule(dynamic)
all iterations will be dynamically divied to each thread
schedule(dynamic, size): size time iterations will be drived  each time
#+begin_src C :results output :exports both
  void main(int argc, char *argv)
  {
    int i = 0;
  #pragma omp parallel for schedule(dynamic)
    for (i = 0; i < 16 ; i++)
      {
        printf("i=%d, thread_id=%d\n", i, omp_get_thread_num());
      }
  }
#+end_src

#+RESULTS:
#+begin_example
i=7, thread_id=7
i=8, thread_id=7
i=9, thread_id=7
i=10, thread_id=7
i=11, thread_id=7
i=12, thread_id=7
i=13, thread_id=7
i=14, thread_id=7
i=15, thread_id=7
i=0, thread_id=3
i=6, thread_id=1
i=5, thread_id=5
i=1, thread_id=6
i=2, thread_id=2
i=4, thread_id=0
i=3, thread_id=4
#+end_example

** schedule(guided)
#+begin_src C :results output :exports both
  void main(int argc, char *argv)
  {
    int i = 0;
  #pragma omp parallel for schedule(guided)
    for (i = 0; i < 16 ; i++)
      {
        printf("i=%d, thread_id=%d\n", i, omp_get_thread_num());
      }
  }
#+end_src

#+RESULTS:
#+begin_example
i=8, thread_id=0
i=11, thread_id=7
i=12, thread_id=7
i=13, thread_id=7
i=14, thread_id=7
i=15, thread_id=7
i=6, thread_id=4
i=7, thread_id=4
i=2, thread_id=2
i=3, thread_id=2
i=4, thread_id=6
i=5, thread_id=6
i=9, thread_id=1
i=10, thread_id=5
i=0, thread_id=3
i=1, thread_id=3
#+end_example

* C/C++ with mpi
sudo apt install libopenmpi-dev

** src compile config
C-h v : org-babel-C-compiler
change gcc to mpicc
mpirun --use-hwthread-cpus
mpirun --host si-u20:8
** MPI_COMM_WORLD
#+begin_src C :results output :exports both  :tangle  ./babel/MPI_COMM_WORLD.c
  #include <stdio.h>
  #include <stdlib.h>
  #include <mpi.h>
  int main(int argc, char* argv[])
  {
      MPI_Init(&argc, &argv);
      int my_rank;
      MPI_Comm_rank(MPI_COMM_WORLD, &my_rank);
      printf("I am MPI process %d.\n", my_rank);
      MPI_Finalize();
      return EXIT_SUCCESS;
  }
#+end_src

#+RESULTS:
: I am MPI process 0.

** hello world of processor 
#+begin_src C :results output :exports both
  #include <mpi.h>
  #include <stdio.h>
  int main(int argc, char** argv) {
      MPI_Init(NULL, NULL);
      int world_size;
      MPI_Comm_size(MPI_COMM_WORLD, &world_size);
      int world_rank;
      MPI_Comm_rank(MPI_COMM_WORLD, &world_rank);
      char processor_name[MPI_MAX_PROCESSOR_NAME];
      int name_len;
      MPI_Get_processor_name(processor_name, &name_len);
      printf("Hello world from processor %s, rank %d out of %d processors\n",
             processor_name, world_rank, world_size);

      MPI_Finalize();
  }
#+end_src

#+RESULTS:
: Hello world from processor silin, rank 0 out of 1 processors

