html/Parallelisum.html
<div id="outline-container-orgb36c2f3" class="outline-3">
<h3 id="orgb36c2f3"><span class="section-number-3">4.19.</span> schedule(static)</h3>
<div class="outline-text-3" id="text-4-19">
<p>
all iterations will be equally divied to each thread
schedule(static, size): size time iterations will be drived  each time
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span>)
{
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = 0;
<span style="color: #bc6ec5;">#pragma</span> omp parallel <span style="color: #4f97d7; font-weight: bold;">for</span> schedule(<span style="color: #4f97d7; font-weight: bold;">static</span>)
  <span style="color: #4f97d7; font-weight: bold;">for</span> (i = 0; i &lt; 24 ; i++)
    {
      printf(<span style="color: #2d9574;">"i=%d, thread_id=%d\n"</span>, i, omp_get_thread_num());
    }
}
</pre>
</div>

<pre class="example" id="org355ace1">
i=0, thread_id=0
i=14, thread_id=7
i=15, thread_id=7
i=2, thread_id=1
i=12, thread_id=6
i=3, thread_id=1
i=18, thread_id=1
i=8, thread_id=4
i=10, thread_id=5
i=19, thread_id=1
i=9, thread_id=4
i=1, thread_id=0
i=11, thread_id=5
i=16, thread_id=0
i=13, thread_id=6
i=4, thread_id=2
i=6, thread_id=3
i=7, thread_id=3
i=22, thread_id=3
i=23, thread_id=3
i=17, thread_id=0
i=5, thread_id=2
i=20, thread_id=2
i=21, thread_id=2
</pre>
</div>
</div>

<div id="outline-container-orgca5a09a" class="outline-3">
<h3 id="orgca5a09a"><span class="section-number-3">4.20.</span> schedule(dynamic)</h3>
<div class="outline-text-3" id="text-4-20">
<p>
all iterations will be dynamically divied to each thread
schedule(dynamic, size): size time iterations will be drived  each time
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span>)
{
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = 0;
<span style="color: #bc6ec5;">#pragma</span> omp parallel <span style="color: #4f97d7; font-weight: bold;">for</span> schedule(dynamic)
  <span style="color: #4f97d7; font-weight: bold;">for</span> (i = 0; i &lt; 16 ; i++)
    {
      printf(<span style="color: #2d9574;">"i=%d, thread_id=%d\n"</span>, i, omp_get_thread_num());
    }
}
</pre>
</div>

<pre class="example" id="orgd66792f">
i=7, thread_id=7
i=8, thread_id=7
i=9, thread_id=7
i=10, thread_id=7
i=11, thread_id=7
i=12, thread_id=7
i=13, thread_id=7
i=14, thread_id=7
i=15, thread_id=7
i=0, thread_id=3
i=6, thread_id=1
i=5, thread_id=5
i=1, thread_id=6
i=2, thread_id=2
i=4, thread_id=0
i=3, thread_id=4
</pre>
</div>
</div>

<div id="outline-container-orge55e07b" class="outline-3">
<h3 id="orge55e07b"><span class="section-number-3">4.21.</span> schedule(guided)</h3>
<div class="outline-text-3" id="text-4-21">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span>)
{
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = 0;
<span style="color: #bc6ec5;">#pragma</span> omp parallel <span style="color: #4f97d7; font-weight: bold;">for</span> schedule(guided)
  <span style="color: #4f97d7; font-weight: bold;">for</span> (i = 0; i &lt; 16 ; i++)
    {
      printf(<span style="color: #2d9574;">"i=%d, thread_id=%d\n"</span>, i, omp_get_thread_num());
    }
}
</pre>
</div>

<pre class="example" id="org9974100">
i=8, thread_id=0
i=11, thread_id=7
i=12, thread_id=7
i=13, thread_id=7
i=14, thread_id=7
i=15, thread_id=7
i=6, thread_id=4
i=7, thread_id=4
i=2, thread_id=2
i=3, thread_id=2
i=4, thread_id=6
i=5, thread_id=6
i=9, thread_id=1
i=10, thread_id=5
i=0, thread_id=3
i=1, thread_id=3
</pre>
</div>
</div>
</div>

<div id="outline-container-orgec47bd6" class="outline-2">
<h2 id="orgec47bd6"><span class="section-number-2">5.</span> C/C++ with mpi</h2>
<div class="outline-text-2" id="text-5">
<p>
sudo apt install libopenmpi-dev
</p>
</div>

<div id="outline-container-orgf21d093" class="outline-3">
<h3 id="orgf21d093"><span class="section-number-3">5.1.</span> src compile config</h3>
<div class="outline-text-3" id="text-5-1">
<p>
C-h v : org-babel-C-compiler
change gcc to mpicc
mpirun &#x2013;use-hwthread-cpus
mpirun &#x2013;host si-u20:8
</p>
</div>
</div>
<div id="outline-container-org2b2e841" class="outline-3">
<h3 id="org2b2e841"><span class="section-number-3">5.2.</span> MPI<sub>COMM</sub><sub>WORLD</sub></h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdio.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdlib.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;mpi.h&gt;</span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">argv</span>[])
{
    MPI_Init(&amp;argc, &amp;argv);
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">my_rank</span>;
    MPI_Comm_rank(MPI_COMM_WORLD, &amp;my_rank);
    printf(<span style="color: #2d9574;">"I am MPI process %d.\n"</span>, my_rank);
    MPI_Finalize();
    <span style="color: #4f97d7; font-weight: bold;">return</span> EXIT_SUCCESS;
}
</pre>
</div>

<pre class="example">
I am MPI process 0.
</pre>
</div>
</div>

<div id="outline-container-org86fe48c" class="outline-3">
<h3 id="org86fe48c"><span class="section-number-3">5.3.</span> hello world of processor</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;mpi.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdio.h&gt;</span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span>** <span style="color: #7590db;">argv</span>) {
    MPI_Init(<span style="color: #a45bad;">NULL</span>, <span style="color: #a45bad;">NULL</span>);
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">world_size</span>;
    MPI_Comm_size(MPI_COMM_WORLD, &amp;world_size);
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">world_rank</span>;
    MPI_Comm_rank(MPI_COMM_WORLD, &amp;world_rank);
    <span style="color: #ce537a; font-weight: bold;">char</span> <span style="color: #7590db;">processor_name</span>[MPI_MAX_PROCESSOR_NAME];
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">name_len</span>;
    MPI_Get_processor_name(processor_name, &amp;name_len);
    printf(<span style="color: #2d9574;">"Hello world from processor %s, rank %d out of %d processors\n"</span>,
           processor_name, world_rank, world_size);

    MPI_Finalize();
}
</pre>
</div>

<pre class="example">
Hello world from processor silin, rank 0 out of 1 processors
</pre>
</div>
</div>
