html/Parallelisum.html

<div id="outline-container-org81f44a2" class="outline-3">
<h3 id="org81f44a2"><span class="section-number-3">5.4.</span> MPI<sub>COMM</sub><sub>CREAT</sub></h3>
<div class="outline-text-3" id="text-5-4">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdio.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdlib.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;mpi.h&gt;</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">argv</span>[])
{
  MPI_Init(&amp;argc, &amp;argv);
  printf(<span style="color: #2d9574;">"\n"</span>);

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Check that the application is run with 6 processes.</span>
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">size</span>;
  MPI_Comm_size(MPI_COMM_WORLD, &amp;size);
  <span style="color: #4f97d7; font-weight: bold;">if</span>(size != 6)
    {
      printf(<span style="color: #2d9574;">"Please run this application with 6 MPI processes.\n"</span>);
      MPI_Abort(MPI_COMM_WORLD, EXIT_FAILURE);
    }

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Get my rank in the global communicator</span>
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">my_rank_global</span>;
  MPI_Comm_rank(MPI_COMM_WORLD, &amp;my_rank_global);

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Get the group or processes of the default communicator</span>
  <span style="color: #ce537a; font-weight: bold;">MPI_Group</span> <span style="color: #7590db;">world_group</span>;
  MPI_Comm_group(MPI_COMM_WORLD, &amp;world_group);

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Create the new communicator from that group of processes.</span>
  <span style="color: #ce537a; font-weight: bold;">MPI_Comm</span> <span style="color: #7590db;">local_communicator</span>;

  <span style="color: #4f97d7; font-weight: bold;">if</span>(my_rank_global == 0 ||
     my_rank_global == 1 ||
     my_rank_global == 2)
    {
      <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Keep MPI processes 0, 1, 2 in a group we will call group A.</span>
      <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">group_a_ranks</span>[3] = {0, 1, 2};
      <span style="color: #ce537a; font-weight: bold;">MPI_Group</span> <span style="color: #7590db;">group_a</span>;
      MPI_Group_incl(world_group, 3, group_a_ranks, &amp;group_a);
      MPI_Comm_create(MPI_COMM_WORLD, group_a, &amp;local_communicator);
    }
  <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #4f97d7; font-weight: bold;">if</span>(my_rank_global == 3 ||
          my_rank_global == 4)
    {
      <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Keep MPI processes 3 and 4 in a group we will call group B.</span>
      <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">group_b_ranks</span>[2] = {3, 4};
      <span style="color: #ce537a; font-weight: bold;">MPI_Group</span> <span style="color: #7590db;">group_b</span>;
      MPI_Group_incl(world_group, 2, group_b_ranks, &amp;group_b);
      MPI_Comm_create(MPI_COMM_WORLD, group_b, &amp;local_communicator);
    }
  <span style="color: #4f97d7; font-weight: bold;">else</span>
    {
      <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Only MPI process 5 remains, without a group</span>
      MPI_Comm_create(MPI_COMM_WORLD, MPI_GROUP_EMPTY, &amp;local_communicator);
    }

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Check if I got into a new communicator (that is, if I was in a group to begin with)</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span>(local_communicator == MPI_COMM_NULL)
    {
      <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">I am not part of the new communicator, I can't participate to that broadcast.</span>
      printf(<span style="color: #2d9574;">"MPI process %d was not part of any group, thus did not get into a new communicator.\n"</span>, my_rank_global);

      <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Let's wait all processes before proceeding to the second phase; Cleaner output.</span>
      MPI_Barrier(MPI_COMM_WORLD);
    }
  <span style="color: #4f97d7; font-weight: bold;">else</span>
    {
      <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Get my rank local to the new communicator</span>
      <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">my_rank_local</span>;
      MPI_Comm_rank(local_communicator, &amp;my_rank_local);

      printf(<span style="color: #2d9574;">"MPI process %d in global communicator has now rank %d in new communicator.\n"</span>, my_rank_global, my_rank_local);

      <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Let's wait all processes before proceeding to the second phase; Cleaner output.</span>
      MPI_Barrier(MPI_COMM_WORLD);

      <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">size_local_communicator</span>;
      MPI_Comm_size(local_communicator, &amp;size_local_communicator);

      <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">The MPI process that got assigned rank 0 in each new communicator will gather all ranks in that communicator and display them</span>
      <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">global_ranks_in_local_communicator</span>[size_local_communicator];
      MPI_Gather(&amp;my_rank_global,
                 1,
                 MPI_INT,
                 global_ranks_in_local_communicator,
                 1,
                 MPI_INT,
                 0,
                 local_communicator);

      <span style="color: #4f97d7; font-weight: bold;">if</span>(my_rank_local == 0)
        {
          printf(<span style="color: #2d9574;">"MPI processes "</span>);
          <span style="color: #4f97d7; font-weight: bold;">for</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = 0; i &lt; size_local_communicator; i++)
            {
              <span style="color: #4f97d7; font-weight: bold;">if</span>(i &gt; 0)
                {
                  printf(<span style="color: #2d9574;">" and "</span>);
                }
              printf(<span style="color: #2d9574;">"%d"</span>, global_ranks_in_local_communicator[i]);
            }
          printf(<span style="color: #2d9574;">" are in the same new communicator.\n"</span>);
        }
    }

  MPI_Finalize();

  <span style="color: #4f97d7; font-weight: bold;">return</span> EXIT_SUCCESS;
}

</pre>
</div>


<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">cd</span> ./babel
mpicc -o mpi_comm_create ./mpi_comm_create.c
mpirun --host silin:6 ./mpi_comm_create
</pre>
</div>

<pre class="example" id="orga44b88f">






MPI process 4 in global communicator has now rank 1 in new communicator.
MPI process 2 in global communicator has now rank 2 in new communicator.
MPI process 0 in global communicator has now rank 0 in new communicator.
MPI process 5 was not part of any group, thus did not get into a new communicator.
MPI process 1 in global communicator has now rank 1 in new communicator.
MPI process 3 in global communicator has now rank 0 in new communicator.
MPI processes 3 and 4 are in the same new communicator.
MPI processes 0 and 1 and 2 are in the same new communicator.
</pre>
</div>
</div>
