Parallelisum.org
** AllReduce
#+begin_src C :results output :exports output :tangle ./babel/mpi_comm_allreduce.c
int main(int argc, char* argv[])
{
    MPI_Init(&argc, &argv);
 
    // Get the size of the communicator
    int size = 0;
    MPI_Comm_size(MPI_COMM_WORLD, &size);
    if(size != 4)
    {
        printf("This application is meant to be run with 4 MPI processes.\n");
        MPI_Abort(MPI_COMM_WORLD, EXIT_FAILURE);
    }
 
    // Get my rank
    int my_rank;
    MPI_Comm_rank(MPI_COMM_WORLD, &my_rank);
 
    // Each MPI process sends its rank to reduction, root MPI process collects the result
    int reduction_result = 0;
    MPI_Allreduce(&my_rank, &reduction_result, 1, MPI_INT, MPI_SUM, MPI_COMM_WORLD);
 
    printf("[MPI Process %d] The sum of all ranks is %d.\n", my_rank, reduction_result);
 
    MPI_Finalize();
 
    return EXIT_SUCCESS;
}
  
#+end_src

#+RESULTS:

* Python
** Multi Thread
:PROPERTIES:
:ID:       9a0bb2b3-cdb5-4ad4-9556-494718b41501
:END:
*** pure thread start
#+begin_src ipython :results output :exports both
  import threading

  def myfunction(a,b):
      print(a*b)

  thread1 = threading.Thread(target= myfunction, args=(2,3))
  thread2 = threading.Thread(target= myfunction, args=(3,4))
  thread1.start()
  thread2.start()

#+end_src

#+RESULTS:

*** thread class
rewrite __init__  and run in class, which inherit class threading.Thread, and start it with start()
#+begin_src python :results output :exports both
  import threading
  import time

  class myThread(threading.Thread):
      def __init__(self, threadID, name, counter):
          threading.Thread.__init__(self)
          self.threadID = threadID
          self.name = name
          self.counter = counter
      def run(self):
          print("Starting " + self.name)
          self.print_time(self.name, 5, self.counter)
          print("Exiting" + self.name)
      def print_time(self, threadName, counter, delay):
          while counter:
              time.sleep(delay)
              print(f"{threadName}, {time.ctime(time.time())}")
              counter -= 1

            
  thread1 = myThread(1, "threadone", 1)
  thread2 = myThread(2, "threadtwo", 2)
  thread1.start()
  thread2.start()
  time.sleep(1)
  print("Exiting Main Thread.")

#+end_src

#+RESULTS:
#+begin_example
Starting threadone
Starting threadtwo
threadone, Tue Jun  7 23:53:02 2022
Exiting Main Thread.
threadtwo, Tue Jun  7 23:53:03 2022
threadone, Tue Jun  7 23:53:03 2022
threadone, Tue Jun  7 23:53:04 2022
threadtwo, Tue Jun  7 23:53:05 2022
threadone, Tue Jun  7 23:53:05 2022
threadone, Tue Jun  7 23:53:06 2022
Exitingthreadone
threadtwo, Tue Jun  7 23:53:07 2022
threadtwo, Tue Jun  7 23:53:09 2022
threadtwo, Tue Jun  7 23:53:11 2022
Exitingthreadtwo
#+end_example

