html/Parallelisum.html

<div id="outline-container-org8babb00" class="outline-3">
<h3 id="org8babb00"><span class="section-number-3">5.5.</span> AllReduce</h3>
<div class="outline-text-3" id="text-5-5">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">argv</span>[])
{
    MPI_Init(&amp;argc, &amp;argv);
 
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Get the size of the communicator</span>
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">size</span> = 0;
    MPI_Comm_size(MPI_COMM_WORLD, &amp;size);
    <span style="color: #4f97d7; font-weight: bold;">if</span>(size != 4)
    {
        printf(<span style="color: #2d9574;">"This application is meant to be run with 4 MPI processes.\n"</span>);
        MPI_Abort(MPI_COMM_WORLD, EXIT_FAILURE);
    }
 
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Get my rank</span>
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">my_rank</span>;
    MPI_Comm_rank(MPI_COMM_WORLD, &amp;my_rank);
 
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Each MPI process sends its rank to reduction, root MPI process collects the result</span>
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">reduction_result</span> = 0;
    MPI_Allreduce(&amp;my_rank, &amp;reduction_result, 1, MPI_INT, MPI_SUM, MPI_COMM_WORLD);
 
    printf(<span style="color: #2d9574;">"[MPI Process %d] The sum of all ranks is %d.\n"</span>, my_rank, reduction_result);
 
    MPI_Finalize();
 
    <span style="color: #4f97d7; font-weight: bold;">return</span> EXIT_SUCCESS;
}
  
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org29651c6" class="outline-2">
<h2 id="org29651c6"><span class="section-number-2">6.</span> Python</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org6eadadb" class="outline-3">
<h3 id="org6eadadb"><span class="section-number-3">6.1.</span> Multi Thread</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org8c669fc" class="outline-4">
<h4 id="org8c669fc"><span class="section-number-4">6.1.1.</span> pure thread start</h4>
<div class="outline-text-4" id="text-6-1-1">
<div class="org-src-container">
<pre class="src src-ipython">import threading

def myfunction(a,b):
    print(a*b)

thread1 = threading.Thread(target= myfunction, args=(2,3))
thread2 = threading.Thread(target= myfunction, args=(3,4))
thread1.start()
thread2.start()

</pre>
</div>
</div>
</div>

<div id="outline-container-org5683a2d" class="outline-4">
<h4 id="org5683a2d"><span class="section-number-4">6.1.2.</span> thread class</h4>
<div class="outline-text-4" id="text-6-1-2">
<p>
rewrite <span class="underline"><span class="underline">init</span></span>  and run in class, which inherit class threading.Thread, and start it with start()
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> threading
<span style="color: #4f97d7; font-weight: bold;">import</span> time

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">myThread</span>(threading.Thread):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>, threadID, name, counter):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   threading.Thread.__init__(<span style="color: #4f97d7; font-weight: bold;">self</span>)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #7590db;">threadID</span> = threadID
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #7590db;">name</span> = name
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #7590db;">counter</span> = counter
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">run</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"Starting "</span> + <span style="color: #4f97d7; font-weight: bold;">self</span>.name)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">self</span>.print_time(<span style="color: #4f97d7; font-weight: bold;">self</span>.name, 5, <span style="color: #4f97d7; font-weight: bold;">self</span>.counter)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"Exiting"</span> + <span style="color: #4f97d7; font-weight: bold;">self</span>.name)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">print_time</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>, threadName, counter, delay):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">while</span> counter:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   time.sleep(delay)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(f<span style="color: #2d9574;">"</span>{threadName}<span style="color: #2d9574;">, </span>{time.ctime(time.time())}<span style="color: #2d9574;">"</span>)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">counter</span> -= 1


<span style="color: #7590db;">thread1</span> = myThread(1, <span style="color: #2d9574;">"threadone"</span>, 1)
<span style="color: #7590db;">thread2</span> = myThread(2, <span style="color: #2d9574;">"threadtwo"</span>, 2)
thread1.start()
thread2.start()
time.sleep(1)
<span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"Exiting Main Thread."</span>)

</pre>
</div>

<pre class="example" id="org6b63db0">
Starting threadone
Starting threadtwo
threadone, Tue Jun  7 23:53:02 2022
Exiting Main Thread.
threadtwo, Tue Jun  7 23:53:03 2022
threadone, Tue Jun  7 23:53:03 2022
threadone, Tue Jun  7 23:53:04 2022
threadtwo, Tue Jun  7 23:53:05 2022
threadone, Tue Jun  7 23:53:05 2022
threadone, Tue Jun  7 23:53:06 2022
Exitingthreadone
threadtwo, Tue Jun  7 23:53:07 2022
threadtwo, Tue Jun  7 23:53:09 2022
threadtwo, Tue Jun  7 23:53:11 2022
Exitingthreadtwo
</pre>
</div>
</div>
