Parallelisum.org
*** thread with Lock
#+begin_src python :results output :exports both
  import threading
  import time

  myLock = threading.Lock()
  class myThread(threading.Thread):
      def __init__(self, threadID, name, counter):
          threading.Thread.__init__(self)
          self.threadID = threadID
          self.name = name
          self.counter = counter
      def run(self):
          print("Starting " + self.name)
          myLock.acquire()
          self.print_time(self.name, 5, self.counter)
          myLock.release()
          print("Exiting" + self.name)
      def print_time(self, threadName, counter, delay):
          while counter:
              time.sleep(delay)
              print(f"{threadName}, {time.ctime(time.time())}")
              counter -= 1

  thread1 = myThread(1, "threadone", 1)
  thread2 = myThread(2, "threadtwo", 2)
  thread1.start()
  thread2.start()
  time.sleep(1)
  print("Exiting Main Thread.")

#+end_src

#+RESULTS:
#+begin_example
Starting threadone
Starting threadtwo
threadone, Tue Jun  7 23:53:58 2022
Exiting Main Thread.
threadone, Tue Jun  7 23:53:59 2022
threadone, Tue Jun  7 23:54:00 2022
threadone, Tue Jun  7 23:54:01 2022
threadone, Tue Jun  7 23:54:02 2022
Exitingthreadone
threadtwo, Tue Jun  7 23:54:04 2022
threadtwo, Tue Jun  7 23:54:06 2022
threadtwo, Tue Jun  7 23:54:08 2022
threadtwo, Tue Jun  7 23:54:10 2022
threadtwo, Tue Jun  7 23:54:12 2022
Exitingthreadtwo
#+end_example

** Multi processing
:PROPERTIES:
:ID:       493fb105-3ca1-4a4a-87b8-94afa870e5b1
:END:
*** pure multi process start
#+begin_src python :results output :exports both
  import multiprocessing
  def myfunction(a,b):
      print(a*b)
  process1 = multiprocessing.Process(target=myfunction, args=(2,9))
  process2 = multiprocessing.Process(target=myfunction, args=(3,4))
  process1.start()
  process2.start()
#+end_src

#+RESULTS:
: 18
: 12

*** multi process differ from multi threading

#+begin_src python :results output :exports both
  #+begin_src python :results output :exports both
import multiprocessing
import threading
import random

def myfunction(shared_result, lock=None):
    value = random.randint(1, 10)
    if lock:
        with lock:
            shared_result.append(value)
    else:
        shared_result.append(value)

# Multiprocessing
if __name__ == "__main__":
    with multiprocessing.Manager() as manager:
        result = manager.list()  # Shared list for multiprocessing
        lock = multiprocessing.Lock()

        process1 = multiprocessing.Process(target=myfunction, args=(result, lock))
        process2 = multiprocessing.Process(target=myfunction, args=(result, lock))
        process1.start()
        process2.start()
        process1.join()
        process2.join()
        print("Result of multiprocessing:", list(result))

    # Threading
    result = []  # Normal list for threading
    lock = threading.Lock()

    thread1 = threading.Thread(target=myfunction, args=(result, lock))
    thread2 = threading.Thread(target=myfunction, args=(result, lock))
    thread1.start()
    thread2.start()
    thread1.join()
    thread2.join()
    print("Result of multi-threading:", result)
#+end_src

#+RESULTS:
: Result of multiprocessing: [4, 1]
: Result of multi-threading: [8, 5]

#+end_src




*** Pool
**** apply
#+begin_src python :results output :exports both
  import multiprocessing as mp
  def myfunction(a, b):
      return a*b

  pool = mp.Pool(mp.cpu_count())
  result = [ pool.apply(myfunction, args=(a, 2)) for a in range(1, 100) ]
  pool.close()
  print(result)

#+end_src

#+RESULTS:
: [2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122, 124, 126, 128, 130, 132, 134, 136, 138, 140, 142, 144, 146, 148, 150, 152, 154, 156, 158, 160, 162, 164, 166, 168, 170, 172, 174, 176, 178, 180, 182, 184, 186, 188, 190, 192, 194, 196, 198]

