html/Parallelisum.html

<div id="outline-container-org6f381a6" class="outline-4">
<h4 id="org6f381a6"><span class="section-number-4">6.1.3.</span> thread with Lock</h4>
<div class="outline-text-4" id="text-6-1-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> threading
<span style="color: #4f97d7; font-weight: bold;">import</span> time

<span style="color: #7590db;">myLock</span> = threading.Lock()
<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">myThread</span>(threading.Thread):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>, threadID, name, counter):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   threading.Thread.__init__(<span style="color: #4f97d7; font-weight: bold;">self</span>)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #7590db;">threadID</span> = threadID
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #7590db;">name</span> = name
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #7590db;">counter</span> = counter
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">run</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"Starting "</span> + <span style="color: #4f97d7; font-weight: bold;">self</span>.name)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   myLock.acquire()
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">self</span>.print_time(<span style="color: #4f97d7; font-weight: bold;">self</span>.name, 5, <span style="color: #4f97d7; font-weight: bold;">self</span>.counter)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   myLock.release()
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"Exiting"</span> + <span style="color: #4f97d7; font-weight: bold;">self</span>.name)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">print_time</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>, threadName, counter, delay):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">while</span> counter:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   time.sleep(delay)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(f<span style="color: #2d9574;">"</span>{threadName}<span style="color: #2d9574;">, </span>{time.ctime(time.time())}<span style="color: #2d9574;">"</span>)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">counter</span> -= 1

<span style="color: #7590db;">thread1</span> = myThread(1, <span style="color: #2d9574;">"threadone"</span>, 1)
<span style="color: #7590db;">thread2</span> = myThread(2, <span style="color: #2d9574;">"threadtwo"</span>, 2)
thread1.start()
thread2.start()
time.sleep(1)
<span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"Exiting Main Thread."</span>)

</pre>
</div>

<pre class="example" id="orgfc93cb4">
Starting threadone
Starting threadtwo
threadone, Tue Jun  7 23:53:58 2022
Exiting Main Thread.
threadone, Tue Jun  7 23:53:59 2022
threadone, Tue Jun  7 23:54:00 2022
threadone, Tue Jun  7 23:54:01 2022
threadone, Tue Jun  7 23:54:02 2022
Exitingthreadone
threadtwo, Tue Jun  7 23:54:04 2022
threadtwo, Tue Jun  7 23:54:06 2022
threadtwo, Tue Jun  7 23:54:08 2022
threadtwo, Tue Jun  7 23:54:10 2022
threadtwo, Tue Jun  7 23:54:12 2022
Exitingthreadtwo
</pre>
</div>
</div>
</div>

<div id="outline-container-org02f8ae6" class="outline-3">
<h3 id="org02f8ae6"><span class="section-number-3">6.2.</span> Multi processing</h3>
<div class="outline-text-3" id="text-6-2">
</div>
<div id="outline-container-org061bc05" class="outline-4">
<h4 id="org061bc05"><span class="section-number-4">6.2.1.</span> pure multi process start</h4>
<div class="outline-text-4" id="text-6-2-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> multiprocessing
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">myfunction</span>(a,b):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(a*b)
<span style="color: #7590db;">process1</span> = multiprocessing.Process(target=myfunction, args=(2,9))
<span style="color: #7590db;">process2</span> = multiprocessing.Process(target=myfunction, args=(3,4))
process1.start()
process2.start()
</pre>
</div>

<pre class="example">
18
12
</pre>
</div>
</div>

<div id="outline-container-org0169821" class="outline-4">
<h4 id="org0169821"><span class="section-number-4">6.2.2.</span> multi process differ from multi threading</h4>
<div class="outline-text-4" id="text-6-2-2">
<div class="org-src-container">
<pre class="src src-python"><span style="background-color: #292e34;"> </span> <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">+begin_src python :results output :exports both</span>
<span style="color: #4f97d7; font-weight: bold;">import</span> multiprocessing
<span style="color: #4f97d7; font-weight: bold;">import</span> threading
<span style="color: #4f97d7; font-weight: bold;">import</span> random

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">myfunction</span>(shared_result, lock=<span style="color: #a45bad;">None</span>):
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">value</span> = random.randint(1, 10)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">if</span> lock:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">with</span> lock:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   shared_result.append(value)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">else</span>:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   shared_result.append(value)

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Multiprocessing</span>
<span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">__name__</span> == <span style="color: #2d9574;">"__main__"</span>:
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">with</span> multiprocessing.Manager() <span style="color: #4f97d7; font-weight: bold;">as</span> manager:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">result</span> = manager.<span style="color: #4f97d7;">list</span>()  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Shared list for multiprocessing</span>
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">lock</span> = multiprocessing.Lock()

<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">process1</span> = multiprocessing.Process(target=myfunction, args=(result, lock))
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">process2</span> = multiprocessing.Process(target=myfunction, args=(result, lock))
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   process1.start()
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   process2.start()
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   process1.join()
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   process2.join()
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"Result of multiprocessing:"</span>, <span style="color: #4f97d7;">list</span>(result))

<span style="background-color: #292e34;"> </span>   <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Threading</span>
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">result</span> = []  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Normal list for threading</span>
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">lock</span> = threading.Lock()

<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">thread1</span> = threading.Thread(target=myfunction, args=(result, lock))
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">thread2</span> = threading.Thread(target=myfunction, args=(result, lock))
<span style="background-color: #292e34;"> </span>   thread1.start()
<span style="background-color: #292e34;"> </span>   thread2.start()
<span style="background-color: #292e34;"> </span>   thread1.join()
<span style="background-color: #292e34;"> </span>   thread2.join()
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"Result of multi-threading:"</span>, result)
</pre>
</div>

<pre class="example">
Result of multiprocessing: [4, 1]
Result of multi-threading: [8, 5]
</pre>


<p>
#+end<sub>src</sub>
</p>
</div>
</div>
