html/Parallelisum.html




<div id="outline-container-org94b41ae" class="outline-4">
<h4 id="org94b41ae"><span class="section-number-4">6.2.3.</span> Pool</h4>
<div class="outline-text-4" id="text-6-2-3">
</div>
<ol class="org-ol">
<li><a id="orgd4d1f67"></a>apply<br />
<div class="outline-text-5" id="text-6-2-3-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> multiprocessing <span style="color: #4f97d7; font-weight: bold;">as</span> mp
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">myfunction</span>(a, b):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> a*b

<span style="color: #7590db;">pool</span> = mp.Pool(mp.cpu_count())
<span style="color: #7590db;">result</span> = [ pool.<span style="color: #4f97d7;">apply</span>(myfunction, args=(a, 2)) <span style="color: #4f97d7; font-weight: bold;">for</span> a <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(1, 100) ]
pool.close()
<span style="color: #4f97d7;">print</span>(result)

</pre>
</div>

<pre class="example">
[2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122, 124, 126, 128, 130, 132, 134, 136, 138, 140, 142, 144, 146, 148, 150, 152, 154, 156, 158, 160, 162, 164, 166, 168, 170, 172, 174, 176, 178, 180, 182, 184, 186, 188, 190, 192, 194, 196, 198]
</pre>
</div>
</li>

<li><a id="org933eda1"></a>map<br />
<div class="outline-text-5" id="text-6-2-3-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> multiprocessing <span style="color: #4f97d7; font-weight: bold;">as</span> mp
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">myfunction</span>(a):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> a*a

<span style="color: #7590db;">pool</span> = mp.Pool(mp.cpu_count())
<span style="color: #7590db;">result</span> =  pool.<span style="color: #4f97d7;">map</span>(myfunction, [a <span style="color: #4f97d7; font-weight: bold;">for</span> a <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(1, 100)]) 
pool.close()
<span style="color: #4f97d7;">print</span>(result)

</pre>
</div>

<pre class="example">
[1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, 361, 400, 441, 484, 529, 576, 625, 676, 729, 784, 841, 900, 961, 1024, 1089, 1156, 1225, 1296, 1369, 1444, 1521, 1600, 1681, 1764, 1849, 1936, 2025, 2116, 2209, 2304, 2401, 2500, 2601, 2704, 2809, 2916, 3025, 3136, 3249, 3364, 3481, 3600, 3721, 3844, 3969, 4096, 4225, 4356, 4489, 4624, 4761, 4900, 5041, 5184, 5329, 5476, 5625, 5776, 5929, 6084, 6241, 6400, 6561, 6724, 6889, 7056, 7225, 7396, 7569, 7744, 7921, 8100, 8281, 8464, 8649, 8836, 9025, 9216, 9409, 9604, 9801]
</pre>
</div>
</li>

<li><a id="org8aea84e"></a>starmap<br />
<div class="outline-text-5" id="text-6-2-3-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> multiprocessing <span style="color: #4f97d7; font-weight: bold;">as</span> mp
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">myfunction</span>(a, b):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> a*b

<span style="color: #7590db;">pool</span> = mp.Pool(mp.cpu_count())
<span style="color: #7590db;">result</span> = pool.starmap(myfunction, [(a, 2) <span style="color: #4f97d7; font-weight: bold;">for</span> a <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(1, 100)] ) 
pool.close()
<span style="color: #4f97d7;">print</span>(result)

</pre>
</div>

<pre class="example">
[2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122, 124, 126, 128, 130, 132, 134, 136, 138, 140, 142, 144, 146, 148, 150, 152, 154, 156, 158, 160, 162, 164, 166, 168, 170, 172, 174, 176, 178, 180, 182, 184, 186, 188, 190, 192, 194, 196, 198]
</pre>
</div>
</li>

<li><a id="org3e5b97d"></a>apply<sub>async</sub><br />
<div class="outline-text-5" id="text-6-2-3-4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> multiprocessing <span style="color: #4f97d7; font-weight: bold;">as</span> mp
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">myfunction</span>(a, b):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> a*b

<span style="color: #7590db;">pool</span> = mp.Pool(mp.cpu_count())
<span style="color: #7590db;">result</span> = [ pool.apply_async(myfunction, args=(a, 2)) <span style="color: #4f97d7; font-weight: bold;">for</span> a <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(1, 100)]
<span style="color: #7590db;">result</span> = [r.get() <span style="color: #4f97d7; font-weight: bold;">for</span> r <span style="color: #4f97d7; font-weight: bold;">in</span> result]
pool.close()
<span style="color: #4f97d7;">print</span>(result)

</pre>
</div>

<pre class="example">
[2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122, 124, 126, 128, 130, 132, 134, 136, 138, 140, 142, 144, 146, 148, 150, 152, 154, 156, 158, 160, 162, 164, 166, 168, 170, 172, 174, 176, 178, 180, 182, 184, 186, 188, 190, 192, 194, 196, 198]
</pre>
</div>
</li>

<li><a id="orgd7b5884"></a>apply<sub>async</sub> with callback, must use wait<br />
<div class="outline-text-5" id="text-6-2-3-5">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> multiprocessing <span style="color: #4f97d7; font-weight: bold;">as</span> mp
<span style="color: #7590db;">results</span> = []
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">myfunction</span>(a, b):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> a*b
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">collect_result</span>(result):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">global</span> results
<span style="background-color: #292e34;"> </span>   results.append(result)

<span style="color: #7590db;">pool</span> = mp.Pool(mp.cpu_count())
<span style="color: #4f97d7; font-weight: bold;">for</span> a <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(1, 100):
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">r</span> = pool.apply_async(myfunction, args=(a, 2), callback=collect_result)
<span style="background-color: #292e34;"> </span>   r.wait()
<span style="background-color: #292e34;"> </span>   pool.close()

<span style="color: #4f97d7;">print</span>(results)
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org7151c3c" class="outline-4">
<h4 id="org7151c3c"><span class="section-number-4">6.2.4.</span> map</h4>
<div class="outline-text-4" id="text-6-2-4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> time
<span style="color: #4f97d7; font-weight: bold;">import</span> concurrent.futures

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">do_something</span>(n):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(f<span style="color: #2d9574;">"sleeping </span>{n}<span style="color: #2d9574;"> seconds"</span>)
<span style="background-color: #292e34;"> </span>   time.sleep(n)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> f<span style="color: #2d9574;">"Done </span>{n}<span style="color: #2d9574;"> seconds sleep"</span>


<span style="color: #4f97d7; font-weight: bold;">with</span> concurrent.futures.ProcessPoolExecutor() <span style="color: #4f97d7; font-weight: bold;">as</span> executor:
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">secs</span> = [5,4,3,2,1]
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">results</span> = executor.<span style="color: #4f97d7;">map</span>(do_something, secs)

<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">for</span> result <span style="color: #4f97d7; font-weight: bold;">in</span> results:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(result)

</pre>
</div>

<pre class="example" id="org28696f5">
sleeping 1 seconds
sleeping 2 seconds
sleeping 3 seconds
sleeping 4 seconds
sleeping 5 seconds
Done 5 seconds sleep
Done 4 seconds sleep
Done 3 seconds sleep
Done 2 seconds sleep
Done 1 seconds sleep
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge814c19" class="outline-2">
<h2 id="orge814c19"><span class="section-number-2">7.</span> Python with mpi</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orga2ee4b1" class="outline-3">
<h3 id="orga2ee4b1"><span class="section-number-3">7.1.</span> send &amp; recv</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">from</span> mpi4py <span style="color: #4f97d7; font-weight: bold;">import</span> MPI
<span style="color: #7590db;">comm</span> = MPI.COMM_WORLD
<span style="color: #7590db;">rank</span> = comm.Get_rank()
<span style="color: #4f97d7; font-weight: bold;">if</span> rank == 0:
<span style="background-color: #292e34;"> </span><span style="color: #7590db;">data</span> = {<span style="color: #2d9574;">'a'</span>: 1, <span style="color: #2d9574;">'b'</span>: 2, <span style="color: #2d9574;">'c'</span>:<span style="color: #2d9574;">'test string'</span>}
<span style="background-color: #292e34;"> </span>comm.send(data,dest=1,tag=11)
<span style="color: #4f97d7; font-weight: bold;">elif</span> rank == 1:
<span style="background-color: #292e34;"> </span><span style="color: #7590db;">data</span> = comm.recv(source=0,tag=11)
<span style="background-color: #292e34;"> </span><span style="color: #4f97d7;">print</span>(data)  
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">mpirun -n 2 python3 ./babel/mpi_python_example01.py
</pre>
</div>

<pre class="example">
{'a': 1, 'b': 2, 'c': 'test string'}
</pre>
</div>
</div>
