Parallelisum.org
** Send & Recv
#+begin_src python :results output :exports both :tangle ./babel/mpi_python_example02.py
  from mpi4py import MPI
  import numpy
  comm = MPI.COMM_WORLD
  rank = comm.Get_rank()
  if rank == 0:
   data = numpy.arange(100, dtype=numpy.float)
   comm.Send(data,dest=1,tag=11)
  elif rank == 1:
   data = numpy.empty(100,dtype=numpy.float)
   comm.Recv(data, source=0,tag=11)
   print(data)
#+end_src

#+begin_src sh  :results output :exports both
  mpirun -n 2 python3 ./babel/mpi_python_example02.py
#+end_src

#+RESULTS:
: [ 0.  1.  2.  3.  4.  5.  6.  7.  8.  9. 10. 11. 12. 13. 14. 15. 16. 17.
:  18. 19. 20. 21. 22. 23. 24. 25. 26. 27. 28. 29. 30. 31. 32. 33. 34. 35.
:  36. 37. 38. 39. 40. 41. 42. 43. 44. 45. 46. 47. 48. 49. 50. 51. 52. 53.
:  54. 55. 56. 57. 58. 59. 60. 61. 62. 63. 64. 65. 66. 67. 68. 69. 70. 71.
:  72. 73. 74. 75. 76. 77. 78. 79. 80. 81. 82. 83. 84. 85. 86. 87. 88. 89.
:  90. 91. 92. 93. 94. 95. 96. 97. 98. 99.]

** Bcast
*** with map bcast
#+begin_src python :results output :exports both :tangle ./babel/mpi_python_example03.py
from mpi4py import MPI
comm = MPI.COMM_WORLD
rank = comm.Get_rank()
if rank == 0:
 data = {'key1' : [7, 2.72, 2+3j], 'key2' : ( 'abc', 'xyz')}
else:
 data = None
data = comm.bcast(data, root=0)
print(data)  
#+end_src


#+begin_src sh  :results output :exports both
  mpirun -n 3 python3 ./babel/mpi_python_example03.py
#+end_src

#+RESULTS:
: {'key1': [7, 2.72, (2+3j)], 'key2': ('abc', 'xyz')}
: {'key1': [7, 2.72, (2+3j)], 'key2': ('abc', 'xyz')}
: {'key1': [7, 2.72, (2+3j)], 'key2': ('abc', 'xyz')}

*** with array Bcast
#+begin_src python :results output :exports both :tangle ./babel/mpi_python_example07.py
  from mpi4py import MPI
  import numpy as np
  comm = MPI.COMM_WORLD
  rank = comm.Get_rank()
  if rank == 0:
   data = np.arange(100, dtype='i')
  else:
   data = np.empty(100, dtype='i')
  comm.Bcast(data, root=0)
  for i in range(100):
   assert data[i] == i

#+end_src


#+begin_src sh  :results output :exports both
  mpirun -n 3 python3 ./babel/mpi_python_example07.py
#+end_src

#+RESULTS:

** scatter
*** with number
#+begin_src python :results output :exports both :tangle ./babel/mpi_python_example04.py
from mpi4py import MPI
comm = MPI.COMM_WORLD
size = comm.Get_size()
rank = comm.Get_rank()
if rank == 0:
 data = [(i+1)**2 for i in range(size)]
else:
 data = None
data = comm.scatter(data, root=0)
assert data == (rank+1)**2
  
#+end_src

#+begin_src sh  :results output :exports both
  mpirun -n 4 python3 ./babel/mpi_python_example04.py
#+end_src

#+RESULTS:

*** with array
#+begin_src python :results output :exports both :tangle ./babel/mpi_python_example08.py
  from mpi4py import MPI
  import numpy as np
  comm = MPI.COMM_WORLD
  size = comm.Get_size()
  rank = comm.Get_rank()
  sendbuf = None
  if rank == 0:
   sendbuf = np.empty([size, 100], dtype='i')
   sendbuf.T[:,:] = range(size)
  recvbuf = np.empty(100, dtype='i')
  comm.Scatter(sendbuf, recvbuf, root=0)
  assert np.allclose(recvbuf, rank)  
#+end_src

#+begin_src sh  :results output :exports both
  mpirun --host si-u20:6 python3 ./babel/mpi_python_example08.py
#+end_src

#+RESULTS:

** Gather
*** with number gather
#+begin_src python :results output :exports both :tangle ./babel/mpi_python_example05.py
  from mpi4py import MPI
  comm = MPI.COMM_WORLD
  size = comm.Get_size()
  rank = comm.Get_rank()
  data = (rank+1)**2
  data = comm.gather(data, root=0)
  if rank == 0:
   for i in range(size):
    assert data[i] == (i+1)**2
  else:
   assert data is None

#+end_src

#+RESULTS:

#+begin_src sh  :results output :exports both
  mpirun --host si-u20:8 python3 ./babel/mpi_python_example05.py
#+end_src

#+RESULTS:
: 8
: 8
: 8
: 8
: 8
: 8
: 8
: 8

