html/Parallelisum.html

<div id="outline-container-org189936f" class="outline-3">
<h3 id="org189936f"><span class="section-number-3">7.2.</span> Send &amp; Recv</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">from</span> mpi4py <span style="color: #4f97d7; font-weight: bold;">import</span> MPI
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy
<span style="color: #7590db;">comm</span> = MPI.COMM_WORLD
<span style="color: #7590db;">rank</span> = comm.Get_rank()
<span style="color: #4f97d7; font-weight: bold;">if</span> rank == 0:
<span style="background-color: #292e34;"> </span><span style="color: #7590db;">data</span> = numpy.arange(100, dtype=numpy.<span style="color: #4f97d7;">float</span>)
<span style="background-color: #292e34;"> </span>comm.Send(data,dest=1,tag=11)
<span style="color: #4f97d7; font-weight: bold;">elif</span> rank == 1:
<span style="background-color: #292e34;"> </span><span style="color: #7590db;">data</span> = numpy.empty(100,dtype=numpy.<span style="color: #4f97d7;">float</span>)
<span style="background-color: #292e34;"> </span>comm.Recv(data, source=0,tag=11)
<span style="background-color: #292e34;"> </span><span style="color: #4f97d7;">print</span>(data)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">mpirun -n 2 python3 ./babel/mpi_python_example02.py
</pre>
</div>

<pre class="example">
[ 0.  1.  2.  3.  4.  5.  6.  7.  8.  9. 10. 11. 12. 13. 14. 15. 16. 17.
 18. 19. 20. 21. 22. 23. 24. 25. 26. 27. 28. 29. 30. 31. 32. 33. 34. 35.
 36. 37. 38. 39. 40. 41. 42. 43. 44. 45. 46. 47. 48. 49. 50. 51. 52. 53.
 54. 55. 56. 57. 58. 59. 60. 61. 62. 63. 64. 65. 66. 67. 68. 69. 70. 71.
 72. 73. 74. 75. 76. 77. 78. 79. 80. 81. 82. 83. 84. 85. 86. 87. 88. 89.
 90. 91. 92. 93. 94. 95. 96. 97. 98. 99.]
</pre>
</div>
</div>

<div id="outline-container-org2d3f158" class="outline-3">
<h3 id="org2d3f158"><span class="section-number-3">7.3.</span> Bcast</h3>
<div class="outline-text-3" id="text-7-3">
</div>
<div id="outline-container-org148fadc" class="outline-4">
<h4 id="org148fadc"><span class="section-number-4">7.3.1.</span> with map bcast</h4>
<div class="outline-text-4" id="text-7-3-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">from</span> mpi4py <span style="color: #4f97d7; font-weight: bold;">import</span> MPI
<span style="color: #7590db;">comm</span> = MPI.COMM_WORLD
<span style="color: #7590db;">rank</span> = comm.Get_rank()
<span style="color: #4f97d7; font-weight: bold;">if</span> rank == 0:
<span style="background-color: #292e34;"> </span><span style="color: #7590db;">data</span> = {<span style="color: #2d9574;">'key1'</span> : [7, 2.72, 2+3j], <span style="color: #2d9574;">'key2'</span> : ( <span style="color: #2d9574;">'abc'</span>, <span style="color: #2d9574;">'xyz'</span>)}
<span style="color: #4f97d7; font-weight: bold;">else</span>:
<span style="background-color: #292e34;"> </span><span style="color: #7590db;">data</span> = <span style="color: #a45bad;">None</span>
<span style="color: #7590db;">data</span> = comm.bcast(data, root=0)
<span style="color: #4f97d7;">print</span>(data)  
</pre>
</div>


<div class="org-src-container">
<pre class="src src-sh">mpirun -n 3 python3 ./babel/mpi_python_example03.py
</pre>
</div>

<pre class="example">
{'key1': [7, 2.72, (2+3j)], 'key2': ('abc', 'xyz')}
{'key1': [7, 2.72, (2+3j)], 'key2': ('abc', 'xyz')}
{'key1': [7, 2.72, (2+3j)], 'key2': ('abc', 'xyz')}
</pre>
</div>
</div>

<div id="outline-container-orgff78956" class="outline-4">
<h4 id="orgff78956"><span class="section-number-4">7.3.2.</span> with array Bcast</h4>
<div class="outline-text-4" id="text-7-3-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">from</span> mpi4py <span style="color: #4f97d7; font-weight: bold;">import</span> MPI
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #7590db;">comm</span> = MPI.COMM_WORLD
<span style="color: #7590db;">rank</span> = comm.Get_rank()
<span style="color: #4f97d7; font-weight: bold;">if</span> rank == 0:
<span style="background-color: #292e34;"> </span><span style="color: #7590db;">data</span> = np.arange(100, dtype=<span style="color: #2d9574;">'i'</span>)
<span style="color: #4f97d7; font-weight: bold;">else</span>:
<span style="background-color: #292e34;"> </span><span style="color: #7590db;">data</span> = np.empty(100, dtype=<span style="color: #2d9574;">'i'</span>)
comm.Bcast(data, root=0)
<span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(100):
<span style="background-color: #292e34;"> </span><span style="color: #4f97d7; font-weight: bold;">assert</span> data[i] == i

</pre>
</div>


<div class="org-src-container">
<pre class="src src-sh">mpirun -n 3 python3 ./babel/mpi_python_example07.py
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org451458e" class="outline-3">
<h3 id="org451458e"><span class="section-number-3">7.4.</span> scatter</h3>
<div class="outline-text-3" id="text-7-4">
</div>
<div id="outline-container-orgae4a483" class="outline-4">
<h4 id="orgae4a483"><span class="section-number-4">7.4.1.</span> with number</h4>
<div class="outline-text-4" id="text-7-4-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">from</span> mpi4py <span style="color: #4f97d7; font-weight: bold;">import</span> MPI
<span style="color: #7590db;">comm</span> = MPI.COMM_WORLD
<span style="color: #7590db;">size</span> = comm.Get_size()
<span style="color: #7590db;">rank</span> = comm.Get_rank()
<span style="color: #4f97d7; font-weight: bold;">if</span> rank == 0:
<span style="background-color: #292e34;"> </span><span style="color: #7590db;">data</span> = [(i+1)**2 <span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(size)]
<span style="color: #4f97d7; font-weight: bold;">else</span>:
<span style="background-color: #292e34;"> </span><span style="color: #7590db;">data</span> = <span style="color: #a45bad;">None</span>
<span style="color: #7590db;">data</span> = comm.scatter(data, root=0)
<span style="color: #4f97d7; font-weight: bold;">assert</span> data == (rank+1)**2

</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">mpirun -n 4 python3 ./babel/mpi_python_example04.py
</pre>
</div>
</div>
</div>

<div id="outline-container-orgac397d2" class="outline-4">
<h4 id="orgac397d2"><span class="section-number-4">7.4.2.</span> with array</h4>
<div class="outline-text-4" id="text-7-4-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">from</span> mpi4py <span style="color: #4f97d7; font-weight: bold;">import</span> MPI
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #7590db;">comm</span> = MPI.COMM_WORLD
<span style="color: #7590db;">size</span> = comm.Get_size()
<span style="color: #7590db;">rank</span> = comm.Get_rank()
<span style="color: #7590db;">sendbuf</span> = <span style="color: #a45bad;">None</span>
<span style="color: #4f97d7; font-weight: bold;">if</span> rank == 0:
<span style="background-color: #292e34;"> </span><span style="color: #7590db;">sendbuf</span> = np.empty([size, 100], dtype=<span style="color: #2d9574;">'i'</span>)
<span style="background-color: #292e34;"> </span>sendbuf.<span style="color: #7590db;">T</span>[:,:] = <span style="color: #4f97d7;">range</span>(size)
<span style="color: #7590db;">recvbuf</span> = np.empty(100, dtype=<span style="color: #2d9574;">'i'</span>)
comm.Scatter(sendbuf, recvbuf, root=0)
<span style="color: #4f97d7; font-weight: bold;">assert</span> np.allclose(recvbuf, rank)  
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">mpirun --host si-u20:6 python3 ./babel/mpi_python_example08.py
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org04e0bde" class="outline-3">
<h3 id="org04e0bde"><span class="section-number-3">7.5.</span> Gather</h3>
<div class="outline-text-3" id="text-7-5">
</div>
<div id="outline-container-org216828a" class="outline-4">
<h4 id="org216828a"><span class="section-number-4">7.5.1.</span> with number gather</h4>
<div class="outline-text-4" id="text-7-5-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">from</span> mpi4py <span style="color: #4f97d7; font-weight: bold;">import</span> MPI
<span style="color: #7590db;">comm</span> = MPI.COMM_WORLD
<span style="color: #7590db;">size</span> = comm.Get_size()
<span style="color: #7590db;">rank</span> = comm.Get_rank()
<span style="color: #7590db;">data</span> = (rank+1)**2
<span style="color: #7590db;">data</span> = comm.gather(data, root=0)
<span style="color: #4f97d7; font-weight: bold;">if</span> rank == 0:
<span style="background-color: #292e34;"> </span><span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(size):
<span style="background-color: #292e34;"> </span> <span style="color: #4f97d7; font-weight: bold;">assert</span> data[i] == (i+1)**2
<span style="color: #4f97d7; font-weight: bold;">else</span>:
<span style="background-color: #292e34;"> </span><span style="color: #4f97d7; font-weight: bold;">assert</span> data <span style="color: #4f97d7; font-weight: bold;">is</span> <span style="color: #a45bad;">None</span>

</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">mpirun --host si-u20:8 python3 ./babel/mpi_python_example05.py
</pre>
</div>

<pre class="example">
8
8
8
8
8
8
8
8
</pre>
</div>
</div>
