Parallelisum.org
*** with array  Gather
#+begin_src python :results output :exports both :tangle ./babel/mpi_python_example09.py
  from mpi4py import MPI
  import numpy as np
  comm = MPI.COMM_WORLD
  size = comm.Get_size()
  rank = comm.Get_rank()
  sendbuf = np.zeros(100, dtype='i') + rank
  recvbuf = None
  if rank == 0:
   recvbuf = np.empty([size, 100], dtype='i')
  comm.Gather(sendbuf, recvbuf, root=0)
  if rank == 0:
   for i in range(size):
    assert np.allclose(recvbuf[i,:], i)
#+end_src

#+RESULTS:

#+begin_src sh  :results output :exports both
  mpirun -n 4 python3 ./babel/mpi_python_example09.py
#+end_src

#+RESULTS:

** Dynamic Process Management
#+begin_src python :results output :exports both :tangle ./babel/mpi_python_example_client.py
  from mpi4py import MPI
  import numpy
  import sys
  comm = MPI.COMM_SELF.Spawn(sys.executable,
                             args=['./mpi_python_example_server.py'],
                             maxprocs=2)
  N = numpy.array(100, 'i')
  comm.Bcast([N, MPI.INT], root=MPI.ROOT)
  PI = numpy.array(0.0, 'd')
  comm.Reduce(None, [PI, MPI.DOUBLE],
              op=MPI.SUM, root=MPI.ROOT)
  print(PI)
  comm.Disconnect()

#+end_src


#+begin_src python :results output :exports both :tangle ./babel/mpi_python_example_server.py
  from mpi4py import MPI
  import numpy
  comm = MPI.Comm.Get_parent()
  size = comm.Get_size()
  rank = comm.Get_rank()
  N = numpy.array(0, dtype='i')
  comm.Bcast([N, MPI.INT], root=0)
  h = 1.0 / N; s = 0.0
  for i in range(rank, N, size):
   x = h * (i + 0.5)
   s += 4.0 / (1.0 + x**2)
  PI = numpy.array(s * h, dtype='d')
  comm.Reduce([PI, MPI.DOUBLE], None, op=MPI.SUM, root=0)
  comm.Disconnect()

#+end_src


#+RESULTS:

#+begin_src sh  :results output :exports both
  
    mpirun --host si-u20:4 python3 ./babel/mpi_python_example_client.py
#+end_src

#+RESULTS:

* Go
** go chan
#+begin_src go :results output :exports both
  package main
  import (
          "fmt"
          "time"
  )
  func main() {
          var times int
          go func() {
                  for {
                  }
          }()
          go func() {
                  for {
                  }
          }()
          go func() {
                  for {
                  }
          }()
          go func() {
                  for {
                  }
          }()
          go func() {
                  for {
                  }
          }()
          for times = 0; times <= 10; times++ {
                  fmt.Println("tick", times)
                  time.Sleep(time.Second)
          }
  }

#+end_src


#+begin_src go :results output :exports both
  package main
  import (
          "fmt"
          "time"
  )
  func main() {
          ch1 := make(chan int)
          go func (ch chan int){
                  for{
                          select {
                          case <- ch:
                                  fmt.Println("get it")
                          default:
                                  fmt.Println("still not")
                          }
                  }
          }(ch1)

          time.Sleep(time.Second)
          ch1 <- 2;
  }

#+end_src

* Go with mpi
** cpuNum
#+begin_src go :results output :exports both :tangle ./babel/go_mpi_cpuNum.go
package main
import (
	"fmt"
	"runtime"
)

func main() {
	cpuNum := runtime.NumCPU()
	fmt.Println("cpu number is :", cpuNum)
	runtime.GOMAXPROCS(cpuNum)
}
#+end_src

#+RESULTS:
: cpu number is : 8

#+begin_src sh :results output :exports both
  go build ./babel/go_mpi_cpuNum.go && ./babel/go_mpi_cpuNum
#+end_src

#+RESULTS:
: cpu number is : 8

** IsOn
#+begin_src go :results output :exports both :tangle ./babel/go_mpi_ison.go
  package main

  import (
          "fmt"
          mpi "github.com/sbromberger/gompi"
  )
  func main() {
          ison := mpi.IsOn()
          if ison {
                  fmt.Println("ison is on")
          } else {
                  fmt.Println("ison is  not on")
          }
          mpi.Start(true)
          ison = mpi.IsOn()
          if ison {
                  fmt.Println("ison is on")
          } else {
                  fmt.Println("ison is  not on ")
          }
          mpi.Stop()
  }
#+end_src

#+RESULTS:

#+begin_src sh :results output :exports both
  cd babel
  go mod tidy
  go build ./go_mpi_ison.go && ./go_mpi_ison
#+end_src

#+RESULTS:
: ison is  not on
: ison is on

** WorldRank
#+begin_src go :results output :exports both :tangle ./babel/go_mpi_WorldRank.go
  package main

  import (
          "fmt"
          mpi "github.com/sbromberger/gompi"
  )
  func main() {
          mpi.Start(true)
          rank := mpi.WorldRank()
          fmt.Println("rank is", rank)
          mpi.Stop()
  }
#+end_src
#+begin_src sh :results output :exports both
  cd babel
  go mod tidy
  go build ./go_mpi_WorldRank.go && mpirun --use-hwthread-cpus ./go_mpi_WorldRank
#+end_src

#+RESULTS:
: rank is 0
: rank is 1
: rank is 2
: rank is 3
: rank is 5
: rank is 7
: rank is 6
: rank is 4

** WorldSize
#+begin_src go :results output :exports both :tangle ./babel/go_mpi_WorldSize.go
  package main

  import (
          "fmt"
          mpi "github.com/sbromberger/gompi"
  )
  func main() {
          mpi.Start(true)
          size := mpi.WorldSize()
          fmt.Println("rank is", size)
          mpi.Stop()
  }
#+end_src
#+begin_src sh :results output :exports both
  cd babel
  go mod tidy
  go build ./go_mpi_WorldSize.go && mpirun --use-hwthread-cpus ./go_mpi_WorldSize
#+end_src

#+RESULTS:
: rank is 8
: rank is 8
: rank is 8
: rank is 8
: rank is 8
: rank is 8
: rank is 8
: rank is 8

