html/Parallelisum.html

<div id="outline-container-org995eea2" class="outline-4">
<h4 id="org995eea2"><span class="section-number-4">7.5.2.</span> with array  Gather</h4>
<div class="outline-text-4" id="text-7-5-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">from</span> mpi4py <span style="color: #4f97d7; font-weight: bold;">import</span> MPI
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #7590db;">comm</span> = MPI.COMM_WORLD
<span style="color: #7590db;">size</span> = comm.Get_size()
<span style="color: #7590db;">rank</span> = comm.Get_rank()
<span style="color: #7590db;">sendbuf</span> = np.zeros(100, dtype=<span style="color: #2d9574;">'i'</span>) + rank
<span style="color: #7590db;">recvbuf</span> = <span style="color: #a45bad;">None</span>
<span style="color: #4f97d7; font-weight: bold;">if</span> rank == 0:
<span style="background-color: #292e34;"> </span><span style="color: #7590db;">recvbuf</span> = np.empty([size, 100], dtype=<span style="color: #2d9574;">'i'</span>)
comm.Gather(sendbuf, recvbuf, root=0)
<span style="color: #4f97d7; font-weight: bold;">if</span> rank == 0:
<span style="background-color: #292e34;"> </span><span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(size):
<span style="background-color: #292e34;"> </span> <span style="color: #4f97d7; font-weight: bold;">assert</span> np.allclose(recvbuf[i,:], i)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">mpirun -n 4 python3 ./babel/mpi_python_example09.py
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org80c655a" class="outline-3">
<h3 id="org80c655a"><span class="section-number-3">7.6.</span> Dynamic Process Management</h3>
<div class="outline-text-3" id="text-7-6">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">from</span> mpi4py <span style="color: #4f97d7; font-weight: bold;">import</span> MPI
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy
<span style="color: #4f97d7; font-weight: bold;">import</span> sys
<span style="color: #7590db;">comm</span> = MPI.COMM_SELF.Spawn(sys.executable,
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>  args=[<span style="color: #2d9574;">'./mpi_python_example_server.py'</span>],
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>  maxprocs=2)
<span style="color: #7590db;">N</span> = numpy.array(100, <span style="color: #2d9574;">'i'</span>)
comm.Bcast([N, MPI.INT], root=MPI.ROOT)
<span style="color: #7590db;">PI</span> = numpy.array(0.0, <span style="color: #2d9574;">'d'</span>)
comm.Reduce(<span style="color: #a45bad;">None</span>, [PI, MPI.DOUBLE],
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   op=MPI.SUM, root=MPI.ROOT)
<span style="color: #4f97d7;">print</span>(PI)
comm.Disconnect()

</pre>
</div>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">from</span> mpi4py <span style="color: #4f97d7; font-weight: bold;">import</span> MPI
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy
<span style="color: #7590db;">comm</span> = MPI.Comm.Get_parent()
<span style="color: #7590db;">size</span> = comm.Get_size()
<span style="color: #7590db;">rank</span> = comm.Get_rank()
<span style="color: #7590db;">N</span> = numpy.array(0, dtype=<span style="color: #2d9574;">'i'</span>)
comm.Bcast([N, MPI.INT], root=0)
<span style="color: #7590db;">h</span> = 1.0 / N; <span style="color: #7590db;">s</span> = 0.0
<span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(rank, N, size):
<span style="background-color: #292e34;"> </span><span style="color: #7590db;">x</span> = h * (i + 0.5)
<span style="background-color: #292e34;"> </span><span style="color: #7590db;">s</span> += 4.0 / (1.0 + x**2)
<span style="color: #7590db;">PI</span> = numpy.array(s * h, dtype=<span style="color: #2d9574;">'d'</span>)
comm.Reduce([PI, MPI.DOUBLE], <span style="color: #a45bad;">None</span>, op=MPI.SUM, root=0)
comm.Disconnect()

</pre>
</div>


<div class="org-src-container">
<pre class="src src-sh">
mpirun --host si-u20:4 python3 ./babel/mpi_python_example_client.py
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org182d4ac" class="outline-2">
<h2 id="org182d4ac"><span class="section-number-2">8.</span> Go</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgdf307bd" class="outline-3">
<h3 id="orgdf307bd"><span class="section-number-3">8.1.</span> go chan</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">
<pre class="src src-go">package main
import (
        "fmt"
        "time"
)
func main() {
        var times int
        go func() {
                for {
                }
        }()
        go func() {
                for {
                }
        }()
        go func() {
                for {
                }
        }()
        go func() {
                for {
                }
        }()
        go func() {
                for {
                }
        }()
        for times = 0; times &lt;= 10; times++ {
                fmt.Println("tick", times)
                time.Sleep(time.Second)
        }
}

</pre>
</div>


<div class="org-src-container">
<pre class="src src-go">package main
import (
        "fmt"
        "time"
)
func main() {
        ch1 := make(chan int)
        go func (ch chan int){
                for{
                        select {
                        case &lt;- ch:
                                fmt.Println("get it")
                        default:
                                fmt.Println("still not")
                        }
                }
        }(ch1)

        time.Sleep(time.Second)
        ch1 &lt;- 2;
}

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbea5845" class="outline-2">
<h2 id="orgbea5845"><span class="section-number-2">9.</span> Go with mpi</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org7db2aa7" class="outline-3">
<h3 id="org7db2aa7"><span class="section-number-3">9.1.</span> cpuNum</h3>
<div class="outline-text-3" id="text-9-1">
<div class="org-src-container">
<pre class="src src-go">package main
import (
        "fmt"
        "runtime"
)

func main() {
        cpuNum := runtime.NumCPU()
        fmt.Println("cpu number is :", cpuNum)
        runtime.GOMAXPROCS(cpuNum)
}
</pre>
</div>

<pre class="example">
cpu number is : 8
</pre>


<div class="org-src-container">
<pre class="src src-sh">go build ./babel/go_mpi_cpuNum.go &amp;&amp; ./babel/go_mpi_cpuNum
</pre>
</div>

<pre class="example">
cpu number is : 8
</pre>
</div>
</div>

<div id="outline-container-orga6cb2d7" class="outline-3">
<h3 id="orga6cb2d7"><span class="section-number-3">9.2.</span> IsOn</h3>
<div class="outline-text-3" id="text-9-2">
<div class="org-src-container">
<pre class="src src-go">package main

import (
        "fmt"
        mpi "github.com/sbromberger/gompi"
)
func main() {
        ison := mpi.IsOn()
        if ison {
                fmt.Println("ison is on")
        } else {
                fmt.Println("ison is  not on")
        }
        mpi.Start(true)
        ison = mpi.IsOn()
        if ison {
                fmt.Println("ison is on")
        } else {
                fmt.Println("ison is  not on ")
        }
        mpi.Stop()
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">cd</span> babel
go mod tidy
go build ./go_mpi_ison.go &amp;&amp; ./go_mpi_ison
</pre>
</div>

<pre class="example">
ison is  not on
ison is on
</pre>
</div>
</div>

<div id="outline-container-orge4aac8b" class="outline-3">
<h3 id="orge4aac8b"><span class="section-number-3">9.3.</span> WorldRank</h3>
<div class="outline-text-3" id="text-9-3">
<div class="org-src-container">
<pre class="src src-go">package main

import (
        "fmt"
        mpi "github.com/sbromberger/gompi"
)
func main() {
        mpi.Start(true)
        rank := mpi.WorldRank()
        fmt.Println("rank is", rank)
        mpi.Stop()
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">cd</span> babel
go mod tidy
go build ./go_mpi_WorldRank.go &amp;&amp; mpirun --use-hwthread-cpus ./go_mpi_WorldRank
</pre>
</div>

<pre class="example">
rank is 0
rank is 1
rank is 2
rank is 3
rank is 5
rank is 7
rank is 6
rank is 4
</pre>
</div>
</div>

<div id="outline-container-org9df4292" class="outline-3">
<h3 id="org9df4292"><span class="section-number-3">9.4.</span> WorldSize</h3>
<div class="outline-text-3" id="text-9-4">
<div class="org-src-container">
<pre class="src src-go">package main

import (
        "fmt"
        mpi "github.com/sbromberger/gompi"
)
func main() {
        mpi.Start(true)
        size := mpi.WorldSize()
        fmt.Println("rank is", size)
        mpi.Stop()
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">cd</span> babel
go mod tidy
go build ./go_mpi_WorldSize.go &amp;&amp; mpirun --use-hwthread-cpus ./go_mpi_WorldSize
</pre>
</div>

<pre class="example">
rank is 8
rank is 8
rank is 8
rank is 8
rank is 8
rank is 8
rank is 8
rank is 8
</pre>
</div>
</div>
