Parallelisum.org
** NewCommunicator
#+begin_src go :results output :exports both :tangle ./babel/go_mpi_NewCommunicator.go
  package main

  import (
          "fmt"
          mpi "github.com/sbromberger/gompi"
  )
  func main() {
          mpi.Start(true)
          var ranks []int
          newComm := mpi.NewCommunicator(ranks)
          fmt.Println("newComm.Size() is :", newComm.Size())
          fmt.Println("newComm.Rank() is :", newComm.Rank())
          mpi.Stop()
  }
#+end_src
#+begin_src sh :results output :exports both
  cd babel
  go mod tidy
  go build ./go_mpi_NewCommunicator.go && mpirun --use-hwthread-cpus ./go_mpi_NewCommunicator
#+end_src

#+RESULTS:
#+begin_example
newComm.Size() is : 8
newComm.Rank() is : 1
newComm.Size() is : 8
newComm.Rank() is : 7
newComm.Size() is : 8
newComm.Rank() is : 2
newComm.Size() is : 8
newComm.Size() is : 8
newComm.Rank() is : 0
newComm.Rank() is : 4
newComm.Size() is : 8
newComm.Rank() is : 3
newComm.Size() is : 8
newComm.Rank() is : 5
newComm.Size() is : 8
newComm.Rank() is : 6
#+end_example


#+begin_src go :results output :exports both :tangle ./babel/go_mpi_NewCommunicator_withranks.go
  package main

  import (
          "fmt"
          mpi "github.com/sbromberger/gompi"
  )
  func main() {
          mpi.Start(true)
          var ranks []int = []int{0,1,2,3}
          newComm := mpi.NewCommunicator(ranks)
          fmt.Println("newComm.Size() is :", newComm.Size())
          fmt.Println("newComm.Rank() is :", newComm.Rank())
          mpi.Stop()
  }
#+end_src
#+begin_src sh :results output :exports both
  cd babel
  go build ./go_mpi_NewCommunicator_withranks.go && mpirun --host si-u20:4 ./go_mpi_NewCommunicator_withranks
#+end_src

#+RESULTS:
: newComm.Size() is : 4
: newComm.Rank() is : 0
: newComm.Size() is : 4
: newComm.Rank() is : 1
: newComm.Size() is : 4
: newComm.Rank() is : 2
: newComm.Size() is : 4
: newComm.Rank() is : 3

** SendInt32 && RecvInt32
#+begin_src go :results output :exports both :tangle ./babel/go_mpi_SendInt32.go
  package main
  import (
          "fmt"
          mpi "github.com/sbromberger/gompi"
  )
  func main() {
          mpi.Start(true)
          fmt.Println()
          var ranks []int 
          newComm := mpi.NewCommunicator(ranks)
          if newComm.Rank() == 0 {
                  var data int32 = 60
                  newComm.SendInt32(data, 1, 10)
          }
          if newComm.Rank() == 1 {
                  data, _ := newComm.RecvInt32(0, 10)
                  fmt.Println(data)
          }
          mpi.Stop()
  }
#+end_src
#+begin_src sh :results output :exports both
  cd babel
  go mod tidy
  go build ./go_mpi_SendInt32.go
  mpirun --use-hwthread-cpus ./go_mpi_SendInt32
#+end_src

#+RESULTS:
: 
: 
: 
: 
: 
: 
: 60
: 
: 

** SendInt32s && RecvInt32s
#+begin_src go :results output :exports both :tangle ./babel/go_mpi_SendUInt32s.go
  package main

  import (
          "fmt"

          mpi "github.com/sbromberger/gompi"
  )
  func main() {
          mpi.Start(true)
          fmt.Println()
          var ranks []int 
          newComm := mpi.NewCommunicator(ranks)
          if newComm.Rank() == 0 {
                  var data []uint32 = []uint32{1, 2, 3, 4}
                  newComm.SendUInt32s(data, 1, 10)
          }
          if newComm.Rank() == 1 {
                  data, _ := newComm.RecvInt32s(0, 10)
                  fmt.Println(data)
          }
          mpi.Stop()
  }
#+end_src
#+begin_src sh :results output :exports both
  cd babel
  go mod tidy
  go build ./go_mpi_SendUInt32s.go
  mpirun --host si:6 ./go_mpi_SendUInt32s
#+end_src

#+RESULTS:
: 
: 
: 
: 
: 
: 
: [1 2 3 4]

** SendString && RecvString
#+begin_src go :tangle ./babel/go_mpi_SendString.go
  package main

  import (
          "fmt"

          mpi "github.com/sbromberger/gompi"
  )
  func main() {
          mpi.Start(true)
          fmt.Println()
          var ranks []int
          newComm := mpi.NewCommunicator(ranks)
          if newComm.Rank() == 0 {
                  str1 := "str11"
                  newComm.SendString("nihao", 1, 11)
                  newComm.SendString(str1, 1, 10)
          }
          // better with differ tags, but with the same tags works here also
          if newComm.Rank() == 1 {
                  nihao, _ := newComm.RecvString(0, 11)
                  str1, _ := newComm.RecvString(0, 10)
                  fmt.Println(nihao)
                  fmt.Println(str1)
          }
          mpi.Stop()
  }

#+end_src

#+begin_src sh :results output :exports both
  cd babel
  go mod tidy
  go build ./go_mpi_SendString.go
  mpirun -n 2 ./go_mpi_SendString
#+end_src

#+RESULTS:
: 
: 
: nihao
: str11

** ReduceInt32s
#+begin_src go :tangle ./babel/go_mpi_ReduceInt32s.go
  package main

  import (
          "fmt"

          mpi "github.com/sbromberger/gompi"
  )
  func main() {
          mpi.Start(true)
          fmt.Println()
          var ranks []int
          newComm := mpi.NewCommunicator(ranks)
          var dest []int32 = []int32{0, 0, 0, 0}
          var send []int32 = []int32{7, 2, 3, 4}
          newComm.ReduceInt32s(dest, send, mpi.OpSum, 0)
          if newComm.Rank() == 0 {
                  fmt.Println(dest)
          }
          mpi.Stop()
  }
#+end_src

#+begin_src sh :results output :exports both
  cd babel
  go mod tidy
  go build ./go_mpi_ReduceInt32s.go
  mpirun -n 4 ./go_mpi_ReduceInt32s
#+end_src

#+RESULTS:
: 
: 
: 
: 
: [28 8 12 16]

** AllreduceInt64s
#+begin_src go :tangle ./babel/go_mpi_AllreduceInt64s.go
  package main
  import (
          "fmt"
          mpi "github.com/sbromberger/gompi"
  )
  func main() {
          mpi.Start(true)
          var ranks []int
          newComm := mpi.NewCommunicator(ranks)
          var dest []int64 = []int64{0, 0}
          var send []int64 = []int64{20 * int64(newComm.Rank()), 2}
          newComm.AllreduceInt64s(dest, send, mpi.OpSum, 0)
          if newComm.Rank() == 0 {
                  fmt.Println(dest)
          }
          mpi.Stop()
  }
#+end_src
#+begin_src sh :results output :exports both
  cd babel
  go mod tidy
  go build ./go_mpi_AllreduceInt64s.go
  mpirun -n 4 ./go_mpi_AllreduceInt64s

#+end_src

#+RESULTS:
: [120 8]

