html/Parallelisum.html

<div id="outline-container-org9582fe5" class="outline-3">
<h3 id="org9582fe5"><span class="section-number-3">9.5.</span> NewCommunicator</h3>
<div class="outline-text-3" id="text-9-5">
<div class="org-src-container">
<pre class="src src-go">package main

import (
        "fmt"
        mpi "github.com/sbromberger/gompi"
)
func main() {
        mpi.Start(true)
        var ranks []int
        newComm := mpi.NewCommunicator(ranks)
        fmt.Println("newComm.Size() is :", newComm.Size())
        fmt.Println("newComm.Rank() is :", newComm.Rank())
        mpi.Stop()
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">cd</span> babel
go mod tidy
go build ./go_mpi_NewCommunicator.go &amp;&amp; mpirun --use-hwthread-cpus ./go_mpi_NewCommunicator
</pre>
</div>

<pre class="example" id="orge57d3b6">
newComm.Size() is : 8
newComm.Rank() is : 1
newComm.Size() is : 8
newComm.Rank() is : 7
newComm.Size() is : 8
newComm.Rank() is : 2
newComm.Size() is : 8
newComm.Size() is : 8
newComm.Rank() is : 0
newComm.Rank() is : 4
newComm.Size() is : 8
newComm.Rank() is : 3
newComm.Size() is : 8
newComm.Rank() is : 5
newComm.Size() is : 8
newComm.Rank() is : 6
</pre>


<div class="org-src-container">
<pre class="src src-go">package main

import (
        "fmt"
        mpi "github.com/sbromberger/gompi"
)
func main() {
        mpi.Start(true)
        var ranks []int = []int{0,1,2,3}
        newComm := mpi.NewCommunicator(ranks)
        fmt.Println("newComm.Size() is :", newComm.Size())
        fmt.Println("newComm.Rank() is :", newComm.Rank())
        mpi.Stop()
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">cd</span> babel
go build ./go_mpi_NewCommunicator_withranks.go &amp;&amp; mpirun --host si-u20:4 ./go_mpi_NewCommunicator_withranks
</pre>
</div>

<pre class="example">
newComm.Size() is : 4
newComm.Rank() is : 0
newComm.Size() is : 4
newComm.Rank() is : 1
newComm.Size() is : 4
newComm.Rank() is : 2
newComm.Size() is : 4
newComm.Rank() is : 3
</pre>
</div>
</div>

<div id="outline-container-org34b541c" class="outline-3">
<h3 id="org34b541c"><span class="section-number-3">9.6.</span> SendInt32 &amp;&amp; RecvInt32</h3>
<div class="outline-text-3" id="text-9-6">
<div class="org-src-container">
<pre class="src src-go">package main
import (
        "fmt"
        mpi "github.com/sbromberger/gompi"
)
func main() {
        mpi.Start(true)
        fmt.Println()
        var ranks []int 
        newComm := mpi.NewCommunicator(ranks)
        if newComm.Rank() == 0 {
                var data int32 = 60
                newComm.SendInt32(data, 1, 10)
        }
        if newComm.Rank() == 1 {
                data, _ := newComm.RecvInt32(0, 10)
                fmt.Println(data)
        }
        mpi.Stop()
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">cd</span> babel
go mod tidy
go build ./go_mpi_SendInt32.go
mpirun --use-hwthread-cpus ./go_mpi_SendInt32
</pre>
</div>

<pre class="example">






60


</pre>
</div>
</div>

<div id="outline-container-orgdebdc77" class="outline-3">
<h3 id="orgdebdc77"><span class="section-number-3">9.7.</span> SendInt32s &amp;&amp; RecvInt32s</h3>
<div class="outline-text-3" id="text-9-7">
<div class="org-src-container">
<pre class="src src-go">package main

import (
        "fmt"

        mpi "github.com/sbromberger/gompi"
)
func main() {
        mpi.Start(true)
        fmt.Println()
        var ranks []int 
        newComm := mpi.NewCommunicator(ranks)
        if newComm.Rank() == 0 {
                var data []uint32 = []uint32{1, 2, 3, 4}
                newComm.SendUInt32s(data, 1, 10)
        }
        if newComm.Rank() == 1 {
                data, _ := newComm.RecvInt32s(0, 10)
                fmt.Println(data)
        }
        mpi.Stop()
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">cd</span> babel
go mod tidy
go build ./go_mpi_SendUInt32s.go
mpirun --host si:6 ./go_mpi_SendUInt32s
</pre>
</div>

<pre class="example">






[1 2 3 4]
</pre>
</div>
</div>

<div id="outline-container-org6b47724" class="outline-3">
<h3 id="org6b47724"><span class="section-number-3">9.8.</span> SendString &amp;&amp; RecvString</h3>
<div class="outline-text-3" id="text-9-8">
<div class="org-src-container">
<pre class="src src-go">package main

import (
        "fmt"

        mpi "github.com/sbromberger/gompi"
)
func main() {
        mpi.Start(true)
        fmt.Println()
        var ranks []int
        newComm := mpi.NewCommunicator(ranks)
        if newComm.Rank() == 0 {
                str1 := "str11"
                newComm.SendString("nihao", 1, 11)
                newComm.SendString(str1, 1, 10)
        }
        // better with differ tags, but with the same tags works here also
        if newComm.Rank() == 1 {
                nihao, _ := newComm.RecvString(0, 11)
                str1, _ := newComm.RecvString(0, 10)
                fmt.Println(nihao)
                fmt.Println(str1)
        }
        mpi.Stop()
}

</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">cd</span> babel
go mod tidy
go build ./go_mpi_SendString.go
mpirun -n 2 ./go_mpi_SendString
</pre>
</div>

<pre class="example">


nihao
str11
</pre>
</div>
</div>

<div id="outline-container-org68c72b2" class="outline-3">
<h3 id="org68c72b2"><span class="section-number-3">9.9.</span> ReduceInt32s</h3>
<div class="outline-text-3" id="text-9-9">
<div class="org-src-container">
<pre class="src src-go">package main

import (
        "fmt"

        mpi "github.com/sbromberger/gompi"
)
func main() {
        mpi.Start(true)
        fmt.Println()
        var ranks []int
        newComm := mpi.NewCommunicator(ranks)
        var dest []int32 = []int32{0, 0, 0, 0}
        var send []int32 = []int32{7, 2, 3, 4}
        newComm.ReduceInt32s(dest, send, mpi.OpSum, 0)
        if newComm.Rank() == 0 {
                fmt.Println(dest)
        }
        mpi.Stop()
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">cd</span> babel
go mod tidy
go build ./go_mpi_ReduceInt32s.go
mpirun -n 4 ./go_mpi_ReduceInt32s
</pre>
</div>

<pre class="example">




[28 8 12 16]
</pre>
</div>
</div>

<div id="outline-container-orga6e2d21" class="outline-3">
<h3 id="orga6e2d21"><span class="section-number-3">9.10.</span> AllreduceInt64s</h3>
<div class="outline-text-3" id="text-9-10">
<div class="org-src-container">
<pre class="src src-go">package main
import (
        "fmt"
        mpi "github.com/sbromberger/gompi"
)
func main() {
        mpi.Start(true)
        var ranks []int
        newComm := mpi.NewCommunicator(ranks)
        var dest []int64 = []int64{0, 0}
        var send []int64 = []int64{20 * int64(newComm.Rank()), 2}
        newComm.AllreduceInt64s(dest, send, mpi.OpSum, 0)
        if newComm.Rank() == 0 {
                fmt.Println(dest)
        }
        mpi.Stop()
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">cd</span> babel
go mod tidy
go build ./go_mpi_AllreduceInt64s.go
mpirun -n 4 ./go_mpi_AllreduceInt64s

</pre>
</div>

<pre class="example">
[120 8]
</pre>
</div>
</div>
