Parallelisum.org
** BcastInt64s
#+begin_src go :tangle ./babel/go_mpi_BcastInt64s.go
  package main
  import (
          "fmt"
          mpi "github.com/sbromberger/gompi"
  )

  func main() {
          mpi.Start(true)
          var ranks []int
          newComm := mpi.NewCommunicator(ranks)
          var send []int64 = []int64{10 + int64(newComm.Rank())}
          fmt.Printf("process %v now has original value of %v from main process  \n", newComm.Rank(), send)
          newComm.BcastInt64s(send, 0)
          if newComm.Rank() != 0 {
             fmt.Printf("process %v now has bordcasted value of %v from main process  \n", newComm.Rank(), send)
          }
          mpi.Stop()
  }

#+end_src

#+RESULTS:

#+begin_src sh :results output :exports both
  cd babel
  go mod tidy
  go build ./go_mpi_BcastInt64s.go
  mpirun -n 4 ./go_mpi_BcastInt64s
#+end_src

#+RESULTS:
: process 3 now has original value of [13] from main process  
: process 1 now has original value of [11] from main process  
: process 0 now has original value of [10] from main process  
: process 2 now has original value of [12] from main process  
: process 1 now has bordcasted value of [10] from main process  
: process 2 now has bordcasted value of [10] from main process  
: process 3 now has bordcasted value of [10] from main process  

** distributed-client
#+begin_src go :tangle ./babel/go_mpi_distributed-client.go
  package main

  import (
          "fmt"
          "math/rand"
          "time"

          mpi "github.com/sbromberger/gompi"
  )

  func main(){
          mpi.Start(true)
          var ranks []int
          newComm := mpi.NewCommunicator(ranks)
          fmt.Println("rank is ", newComm.Rank())
          start := []float64{0, 0, 0}
          ends := []float64{0, 0, 0}
          newComm.BcastFloat64s(start, 0)
	
          if newComm.Rank() != 0 {
                  for { 
                          for i, x := range start {
                                  start[i] = x+float64(rand.Intn(10))
                          }
                          time.Sleep(time.Second)
                          fmt.Printf("process %v now has value of %v from main process \n", newComm.Rank(), start)
                          newComm.SendFloat64s(start, 0, newComm.Rank())
                          start, _ = newComm.RecvFloat64s(0, newComm.Rank())
                  }
          }

          if newComm.Rank() == 0 {
                  go func (){
                          for { 
                                  start, _ := newComm.RecvFloat64s(1, 1)
                                  for i, _ := range start {
                                          start[i] = start[i] * ends[i]
                                  }
                                  newComm.SendFloat64s(start, 1, 1)
                          }
                  }()

                  go func (){
                          for { 
                                  start, _ := newComm.RecvFloat64s(2, 2)
                                  for i, _ := range start {
                                          start[i] = start[i] * ends[i]
                                  }
                                  newComm.SendFloat64s(start, 2, 2)
                          }
                  }()

                  go func (){
                          for { 
                                  start, _ := newComm.RecvFloat64s(3, 3)
                                  for i, _ := range start {
                                          start[i] = start[i] * ends[i]
                                  }
                                  newComm.SendFloat64s(start, 3, 3)
                          }
                  }()
          }
          mpi.Stop()
  }


#+end_src

#+RESULTS:

#+begin_src sh :results output :exports both
  cd babel
  go mod tidy
  go build ./go_mpi_distributed-client.go
  mpirun -n 4 ./go_mpi_distributed-client
#+end_src



** Distributed learning server client
#+begin_src  go :tangle ./babel/go_mpi_distributed-client.go
package main

import (
	"fmt"
	"sync"
	"time"

	mpi "github.com/sbromberger/gompi"
)

func mainn(){
	mpi.Start(true)
	var ranks []int
	newComm := mpi.NewCommunicator(ranks)
	
	start := []float64{float64(newComm.Rank()), float64(newComm.Rank()), float64(newComm.Rank())}
	//	ends := []float64{0, 0, 0}
	var m sync.Mutex
	ch1 := make(chan []float64, 3)
	ch2 := make(chan []float64, 3)
	ch3 := make(chan []float64, 3)
	fmt.Printf("Orignal: %v now has value of %v from main process \n", newComm.Rank(), start)

	newComm.BcastFloat64s(start, 0)
		
	if newComm.Rank() == 0 {
		go func (ch0 chan []float64){
			for { 
				start, _ := newComm.RecvFloat64s(1, 1)
				ch0 <- start
			}
		}(ch1)

		go func (ch0 chan []float64){
			for { 
				start, _ := newComm.RecvFloat64s(2, 2)
				ch0 <- start;
			}
		}(ch2)

		go func (ch0 chan []float64){
			for { 
				start, _ := newComm.RecvFloat64s(3, 3)
				ch0 <- start;
			}
		}(ch3)
	}
	
	func (newComm *mpi.Communicator ) {
		for {
			select {
			case <- ch1:
				m.Lock()
				data := <- ch1
				for i, _ := range start {
					start[i] = start[i] * data[i]
				}
				m.Unlock()
				newComm.BcastFloat64s(start, 0)
				fmt.Printf("From process %v now has value of %v from main process \n", data, start)
			case <- ch2:
				m.Lock()
				data := <- ch2
				for i, _ := range start {
					start[i] = start[i] * data[i]
				}
				m.Unlock()
				newComm.BcastFloat64s(start, 0)
				fmt.Printf("From process %v now has value of %v from main process \n", data, start)
			case <- ch3:
				m.Lock()
				data := <- ch3
				for i, _ := range start {
					start[i] = start[i] * data[i]
				}
				m.Unlock()
				newComm.BcastFloat64s(start, 0)
				fmt.Printf("From process %v now has value of %v from main process \n", data, start)
				default:
			}
		}
	}(newComm)

	
	if newComm.Rank() != 0 {
		for {
			time.Sleep(time.Second*2)
			fmt.Printf("PROCESS: %v now has value of %v from main process \n", newComm.Rank(), start)
			for i, x := range start {
				start[i] = x+1
			}
			newComm.SendFloat64s(start, 0, newComm.Rank())
		}
	}

	mpi.Stop()
}


#+end_src


