html/Parallelisum.html

<div id="outline-container-orge56a0c1" class="outline-3">
<h3 id="orge56a0c1"><span class="section-number-3">9.11.</span> BcastInt64s</h3>
<div class="outline-text-3" id="text-9-11">
<div class="org-src-container">
<pre class="src src-go">package main
import (
        "fmt"
        mpi "github.com/sbromberger/gompi"
)

func main() {
        mpi.Start(true)
        var ranks []int
        newComm := mpi.NewCommunicator(ranks)
        var send []int64 = []int64{10 + int64(newComm.Rank())}
        fmt.Printf("process %v now has original value of %v from main process  \n", newComm.Rank(), send)
        newComm.BcastInt64s(send, 0)
        if newComm.Rank() != 0 {
           fmt.Printf("process %v now has bordcasted value of %v from main process  \n", newComm.Rank(), send)
        }
        mpi.Stop()
}

</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">cd</span> babel
go mod tidy
go build ./go_mpi_BcastInt64s.go
mpirun -n 4 ./go_mpi_BcastInt64s
</pre>
</div>

<pre class="example">
process 3 now has original value of [13] from main process  
process 1 now has original value of [11] from main process  
process 0 now has original value of [10] from main process  
process 2 now has original value of [12] from main process  
process 1 now has bordcasted value of [10] from main process  
process 2 now has bordcasted value of [10] from main process  
process 3 now has bordcasted value of [10] from main process  
</pre>
</div>
</div>

<div id="outline-container-org0235708" class="outline-3">
<h3 id="org0235708"><span class="section-number-3">9.12.</span> distributed-client</h3>
<div class="outline-text-3" id="text-9-12">
<div class="org-src-container">
<pre class="src src-go">package main

import (
        "fmt"
        "math/rand"
        "time"

        mpi "github.com/sbromberger/gompi"
)

func main(){
        mpi.Start(true)
        var ranks []int
        newComm := mpi.NewCommunicator(ranks)
        fmt.Println("rank is ", newComm.Rank())
        start := []float64{0, 0, 0}
        ends := []float64{0, 0, 0}
        newComm.BcastFloat64s(start, 0)

        if newComm.Rank() != 0 {
                for { 
                        for i, x := range start {
                                start[i] = x+float64(rand.Intn(10))
                        }
                        time.Sleep(time.Second)
                        fmt.Printf("process %v now has value of %v from main process \n", newComm.Rank(), start)
                        newComm.SendFloat64s(start, 0, newComm.Rank())
                        start, _ = newComm.RecvFloat64s(0, newComm.Rank())
                }
        }

        if newComm.Rank() == 0 {
                go func (){
                        for { 
                                start, _ := newComm.RecvFloat64s(1, 1)
                                for i, _ := range start {
                                        start[i] = start[i] * ends[i]
                                }
                                newComm.SendFloat64s(start, 1, 1)
                        }
                }()

                go func (){
                        for { 
                                start, _ := newComm.RecvFloat64s(2, 2)
                                for i, _ := range start {
                                        start[i] = start[i] * ends[i]
                                }
                                newComm.SendFloat64s(start, 2, 2)
                        }
                }()

                go func (){
                        for { 
                                start, _ := newComm.RecvFloat64s(3, 3)
                                for i, _ := range start {
                                        start[i] = start[i] * ends[i]
                                }
                                newComm.SendFloat64s(start, 3, 3)
                        }
                }()
        }
        mpi.Stop()
}


</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">cd</span> babel
go mod tidy
go build ./go_mpi_distributed-client.go
mpirun -n 4 ./go_mpi_distributed-client
</pre>
</div>
</div>
</div>



<div id="outline-container-orgf98fcde" class="outline-3">
<h3 id="orgf98fcde"><span class="section-number-3">9.13.</span> Distributed learning server client</h3>
<div class="outline-text-3" id="text-9-13">
<div class="org-src-container">
<pre class="src src-go">package main

import (
        "fmt"
        "sync"
        "time"

        mpi "github.com/sbromberger/gompi"
)

func mainn(){
        mpi.Start(true)
        var ranks []int
        newComm := mpi.NewCommunicator(ranks)

        start := []float64{float64(newComm.Rank()), float64(newComm.Rank()), float64(newComm.Rank())}
        //	ends := []float64{0, 0, 0}
        var m sync.Mutex
        ch1 := make(chan []float64, 3)
        ch2 := make(chan []float64, 3)
        ch3 := make(chan []float64, 3)
        fmt.Printf("Orignal: %v now has value of %v from main process \n", newComm.Rank(), start)

        newComm.BcastFloat64s(start, 0)

        if newComm.Rank() == 0 {
                go func (ch0 chan []float64){
                        for { 
                                start, _ := newComm.RecvFloat64s(1, 1)
                                ch0 &lt;- start
                        }
                }(ch1)

                go func (ch0 chan []float64){
                        for { 
                                start, _ := newComm.RecvFloat64s(2, 2)
                                ch0 &lt;- start;
                        }
                }(ch2)

                go func (ch0 chan []float64){
                        for { 
                                start, _ := newComm.RecvFloat64s(3, 3)
                                ch0 &lt;- start;
                        }
                }(ch3)
        }

        func (newComm *mpi.Communicator ) {
                for {
                        select {
                        case &lt;- ch1:
                                m.Lock()
                                data := &lt;- ch1
                                for i, _ := range start {
                                        start[i] = start[i] * data[i]
                                }
                                m.Unlock()
                                newComm.BcastFloat64s(start, 0)
                                fmt.Printf("From process %v now has value of %v from main process \n", data, start)
                        case &lt;- ch2:
                                m.Lock()
                                data := &lt;- ch2
                                for i, _ := range start {
                                        start[i] = start[i] * data[i]
                                }
                                m.Unlock()
                                newComm.BcastFloat64s(start, 0)
                                fmt.Printf("From process %v now has value of %v from main process \n", data, start)
                        case &lt;- ch3:
                                m.Lock()
                                data := &lt;- ch3
                                for i, _ := range start {
                                        start[i] = start[i] * data[i]
                                }
                                m.Unlock()
                                newComm.BcastFloat64s(start, 0)
                                fmt.Printf("From process %v now has value of %v from main process \n", data, start)
                                default:
                        }
                }
        }(newComm)


        if newComm.Rank() != 0 {
                for {
                        time.Sleep(time.Second*2)
                        fmt.Printf("PROCESS: %v now has value of %v from main process \n", newComm.Rank(), start)
                        for i, x := range start {
                                start[i] = x+1
                        }
                        newComm.SendFloat64s(start, 0, newComm.Rank())
                }
        }

        mpi.Stop()
}


</pre>
</div>
</div>
</div>
