Parallelisum.org
** Distributed learning server client one to one
#+begin_src  go :tangle ./babel/go_mpi_distributed-client.go
package main

import (
	"fmt"
	"time"

	mpi "github.com/sbromberger/gompi"
)


func main(){
	mpi.Start(true)
	var ranks []int
	newComm := mpi.NewCommunicator(ranks)
	ch0 := make(chan int)
	
	start := []float64{float64(newComm.Rank()), float64(newComm.Rank()), float64(newComm.Rank())}
	fmt.Printf("Orignal: %v now has value of %v from main process \n", newComm.Rank(), start)

	go func (newComm *mpi.Communicator, ch0 chan int) {
		time.Sleep(time.Second*1)
		for {
			select {
			case data := <- ch0:
				for i, _ := range start {
					start[i] = start[i] * float64(data)
				}
				fmt.Printf("From server: %v now has value of %v from main process \n", newComm.Rank(), start)
				newComm.BcastFloat64s(start, 0)
			case <-	time.After(time.Minute):
				fmt.Println("Time out")
			}
		}
	}(newComm, ch0)

	if newComm.Rank() == 0 {
		go func (ch0 chan int ){
			for {
				newComm.RecvFloat64s(1, 1)
				ch0 <- 1;
			}
		}(ch0)
	}

	if newComm.Rank() == 1 {
		for {
			time.Sleep(time.Second*2)
			for i, _ := range start {
				start[i] = start[i] + 2
			}
			fmt.Printf("From client: %v now has value of %v from main process \n", newComm.Rank(), start)
			newComm.SendFloat64s(start, 0, newComm.Rank())
		}
	}

	time.Sleep(time.Minute)
	mpi.Stop()
}


#+end_src

* GPGPU
