html/Parallelisum.html


<div id="outline-container-orgc0f9aec" class="outline-3">
<h3 id="orgc0f9aec"><span class="section-number-3">9.14.</span> Distributed learning server client one to one</h3>
<div class="outline-text-3" id="text-9-14">
<div class="org-src-container">
<pre class="src src-go">package main

import (
        "fmt"
        "time"

        mpi "github.com/sbromberger/gompi"
)


func main(){
        mpi.Start(true)
        var ranks []int
        newComm := mpi.NewCommunicator(ranks)
        ch0 := make(chan int)

        start := []float64{float64(newComm.Rank()), float64(newComm.Rank()), float64(newComm.Rank())}
        fmt.Printf("Orignal: %v now has value of %v from main process \n", newComm.Rank(), start)

        go func (newComm *mpi.Communicator, ch0 chan int) {
                time.Sleep(time.Second*1)
                for {
                        select {
                        case data := &lt;- ch0:
                                for i, _ := range start {
                                        start[i] = start[i] * float64(data)
                                }
                                fmt.Printf("From server: %v now has value of %v from main process \n", newComm.Rank(), start)
                                newComm.BcastFloat64s(start, 0)
                        case &lt;-	time.After(time.Minute):
                                fmt.Println("Time out")
                        }
                }
        }(newComm, ch0)

        if newComm.Rank() == 0 {
                go func (ch0 chan int ){
                        for {
                                newComm.RecvFloat64s(1, 1)
                                ch0 &lt;- 1;
                        }
                }(ch0)
        }

        if newComm.Rank() == 1 {
                for {
                        time.Sleep(time.Second*2)
                        for i, _ := range start {
                                start[i] = start[i] + 2
                        }
                        fmt.Printf("From client: %v now has value of %v from main process \n", newComm.Rank(), start)
                        newComm.SendFloat64s(start, 0, newComm.Rank())
                }
        }

        time.Sleep(time.Minute)
        mpi.Stop()
}


</pre>
</div>
</div>
</div>
</div>
