html/Parallelisum.html

<div id="outline-container-orgd6b1c26" class="outline-2">
<h2 id="orgd6b1c26"><span class="section-number-2">10.</span> GPGPU</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orgd12c5ee" class="outline-3">
<h3 id="orgd12c5ee"><span class="section-number-3">10.1.</span> get variables</h3>
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdio.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;cuda.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;assert.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;cuda_runtime.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;curand_kernel.h&gt;</span>
<span style="color: #bc6ec5;">#define</span> <span style="color: #7590db;">N</span> 32
__global__ <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">add</span>(
                    <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">dthreadIdx_x</span>,
                    <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">dthreadIdx_y</span>,
                    <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">dthreadIdx_z</span>,
                    <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">dblockIdx_x</span>,
                    <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">dblockIdx_y</span>,
                    <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">dblockIdx_z</span>,
                    <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">dblockDim_x</span>,
                    <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">dblockDim_y</span>,
                    <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">dblockDim_z</span>,
                    <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">dgridDim_x</span>,
                    <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">dgridDim_y</span>,
                    <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">dgridDim_z</span>){
  *dthreadIdx_x = threadIdx.x;
  *dthreadIdx_y = threadIdx.y;
  *dthreadIdx_z = threadIdx.z;
  *dblockIdx_x = blockIdx.x;
  *dblockIdx_y = blockIdx.y;
  *dblockIdx_z = blockIdx.z;
  *dblockDim_x = blockDim.x;
  *dblockDim_y = blockDim.y;
  *dblockDim_z = blockDim.z;
  *dgridDim_x = gridDim.x;
  *dgridDim_y = gridDim.y;
  *dgridDim_z = gridDim.z;
}
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>()
{
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">threadIdx_x</span> = 0;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">threadIdx_y</span> = 0;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">threadIdx_z</span> = 0;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">blockIdx_x</span> = 0;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">blockIdx_y</span> = 0;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">blockIdx_z</span> = 0;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">blockDim_x</span> = 0;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">blockDim_y</span> = 0;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">blockDim_z</span> = 0;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">gridDim_x</span> = 0;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">gridDim_y</span> = 0;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">gridDim_z</span> = 0;

  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">dthreadIdx_x</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">dthreadIdx_y</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">dthreadIdx_z</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">dblockIdx_x</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">dblockIdx_y</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">dblockIdx_z</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">dblockDim_x</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">dblockDim_y</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">dblockDim_z</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">dgridDim_x</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">dgridDim_y</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">dgridDim_z</span>;

  cudaMalloc((<span style="color: #ce537a; font-weight: bold;">void</span> **)&amp;dthreadIdx_x, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>));
  cudaMalloc((<span style="color: #ce537a; font-weight: bold;">void</span> **)&amp;dthreadIdx_y, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>));
  cudaMalloc((<span style="color: #ce537a; font-weight: bold;">void</span> **)&amp;dthreadIdx_z, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>));
  cudaMalloc((<span style="color: #ce537a; font-weight: bold;">void</span> **)&amp;dblockIdx_x, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>));
  cudaMalloc((<span style="color: #ce537a; font-weight: bold;">void</span> **)&amp;dblockIdx_y, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>));
  cudaMalloc((<span style="color: #ce537a; font-weight: bold;">void</span> **)&amp;dblockIdx_z, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>));
  cudaMalloc((<span style="color: #ce537a; font-weight: bold;">void</span> **)&amp;dblockDim_x, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>));
  cudaMalloc((<span style="color: #ce537a; font-weight: bold;">void</span> **)&amp;dblockDim_y, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>));
  cudaMalloc((<span style="color: #ce537a; font-weight: bold;">void</span> **)&amp;dblockDim_z, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>));
  cudaMalloc((<span style="color: #ce537a; font-weight: bold;">void</span> **)&amp;dgridDim_x, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>));
  cudaMalloc((<span style="color: #ce537a; font-weight: bold;">void</span> **)&amp;dgridDim_y, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>));
  cudaMalloc((<span style="color: #ce537a; font-weight: bold;">void</span> **)&amp;dgridDim_z, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>));

  <span style="color: #ce537a; font-weight: bold;">dim3</span> <span style="color: #bc6ec5; font-weight: bold;">BlockPerGrid</span>(1, 1, 1);
  <span style="color: #ce537a; font-weight: bold;">dim3</span> <span style="color: #bc6ec5; font-weight: bold;">ThreadsPerBlock</span>(N, N, 1);
  add &lt;&lt;&lt; BlockPerGrid, ThreadsPerBlock &gt;&gt;&gt;(
                                            dthreadIdx_x,
                                            dthreadIdx_y,
                                            dthreadIdx_z,
                                            dblockIdx_x,
                                            dblockIdx_y,
                                            dblockIdx_z,
                                            dblockDim_x,
                                            dblockDim_y,
                                            dblockDim_z,
                                            dgridDim_x,
                                            dgridDim_y,
                                            dgridDim_z
                                            );
  cudaMemcpy(&amp;threadIdx_x,dthreadIdx_x, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>), cudaMemcpyDeviceToHost);
  printf(<span style="color: #2d9574;">"threadIdx_x is %d \n"</span>, threadIdx_x);
  cudaMemcpy(&amp;threadIdx_y,dthreadIdx_y, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>), cudaMemcpyDeviceToHost);
  printf(<span style="color: #2d9574;">"threadIdx_y is %d \n"</span>, threadIdx_y);
  cudaMemcpy(&amp;threadIdx_z,dthreadIdx_z, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>), cudaMemcpyDeviceToHost);
  printf(<span style="color: #2d9574;">"threadIdx_z is %d \n"</span>, threadIdx_z);

  cudaMemcpy(&amp;blockIdx_x, dblockIdx_x, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>), cudaMemcpyDeviceToHost);
  printf(<span style="color: #2d9574;">"blockIdx_x is %d \n"</span>, blockIdx_x);
  cudaMemcpy(&amp;blockIdx_y, dblockIdx_y, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>), cudaMemcpyDeviceToHost);
  printf(<span style="color: #2d9574;">"blockIdx_y is %d \n"</span>, blockIdx_y);
  cudaMemcpy(&amp;blockIdx_z, dblockIdx_z, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>), cudaMemcpyDeviceToHost);
  printf(<span style="color: #2d9574;">"blockIdx_z is %d \n"</span>, blockIdx_z);


  cudaMemcpy(&amp;blockDim_x, dblockDim_x, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>), cudaMemcpyDeviceToHost);
  printf(<span style="color: #2d9574;">"blockDim_x is %d \n"</span>, blockDim_x);
  cudaMemcpy(&amp;blockDim_y, dblockDim_y, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>), cudaMemcpyDeviceToHost);
  printf(<span style="color: #2d9574;">"blockDim_y is %d \n"</span>, blockDim_y);
  cudaMemcpy(&amp;blockDim_z, dblockDim_z, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>), cudaMemcpyDeviceToHost);
  printf(<span style="color: #2d9574;">"blockDim_z is %d \n"</span>, blockDim_z);

  cudaMemcpy(&amp;gridDim_x, dgridDim_x, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>), cudaMemcpyDeviceToHost);
  printf(<span style="color: #2d9574;">"gridDim_x is %d \n"</span>, gridDim_x);
  cudaMemcpy(&amp;gridDim_y, dgridDim_y, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>), cudaMemcpyDeviceToHost);
  printf(<span style="color: #2d9574;">"gridDim_y is %d \n"</span>, gridDim_y);
  cudaMemcpy(&amp;gridDim_z, dgridDim_z, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>), cudaMemcpyDeviceToHost);
  printf(<span style="color: #2d9574;">"gridDim_z is %d \n"</span>, gridDim_z);

  <span style="color: #4f97d7; font-weight: bold;">return</span> 0;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">cd</span> babel
nvcc gpu_get_variables.cu -o gpu_get_variables
./gpu_get_variables

</pre>
</div>
</div>
</div>
