html/Parallelisum.html



<div id="outline-container-orga35db22" class="outline-3">
<h3 id="orga35db22"><span class="section-number-3">10.2.</span> Addition dim 1</h3>
<div class="outline-text-3" id="text-10-2">
</div>
<div id="outline-container-orgda847d1" class="outline-4">
<h4 id="orgda847d1"><span class="section-number-4">10.2.1.</span> without parallelism</h4>
<div class="outline-text-4" id="text-10-2-1">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdio.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdlib.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;math.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;assert.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;cuda.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;cuda_runtime.h&gt;</span>

<span style="color: #bc6ec5;">#define</span> <span style="color: #7590db;">N</span> 10000000
<span style="color: #bc6ec5;">#define</span> <span style="color: #7590db;">MAX_ERR</span> 1e-6

__global__ <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">vector_add</span>(<span style="color: #ce537a; font-weight: bold;">float</span> *<span style="color: #7590db;">out</span>, <span style="color: #ce537a; font-weight: bold;">float</span> *<span style="color: #7590db;">a</span>, <span style="color: #ce537a; font-weight: bold;">float</span> *<span style="color: #7590db;">b</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">n</span>) {
  <span style="color: #4f97d7; font-weight: bold;">for</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = 0; i &lt; n; i ++){
    out[i] = a[i] + b[i];
  }
}

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(){
  <span style="color: #ce537a; font-weight: bold;">float</span> *<span style="color: #7590db;">a</span>, *<span style="color: #7590db;">b</span>, *<span style="color: #7590db;">out</span>;
  <span style="color: #ce537a; font-weight: bold;">float</span> *<span style="color: #7590db;">d_a</span>, *<span style="color: #7590db;">d_b</span>, *<span style="color: #7590db;">d_out</span>; 

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Allocate host memory</span>
  a   = (<span style="color: #ce537a; font-weight: bold;">float</span>*)malloc(<span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">float</span>) * N);
  b   = (<span style="color: #ce537a; font-weight: bold;">float</span>*)malloc(<span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">float</span>) * N);
  out = (<span style="color: #ce537a; font-weight: bold;">float</span>*)malloc(<span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">float</span>) * N);

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Initialize host arrays</span>
  <span style="color: #4f97d7; font-weight: bold;">for</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = 0; i &lt; N; i++){
    a[i] = 1.0f;
    b[i] = 2.0f;
  }

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Allocate device memory</span>
  cudaMalloc((<span style="color: #ce537a; font-weight: bold;">void</span>**)&amp;d_a, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">float</span>) * N);
  cudaMalloc((<span style="color: #ce537a; font-weight: bold;">void</span>**)&amp;d_b, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">float</span>) * N);
  cudaMalloc((<span style="color: #ce537a; font-weight: bold;">void</span>**)&amp;d_out, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">float</span>) * N);

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Transfer data from host to device memory</span>
  cudaMemcpy(d_a, a, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">float</span>) * N, cudaMemcpyHostToDevice);
  cudaMemcpy(d_b, b, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">float</span>) * N, cudaMemcpyHostToDevice);

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Executing kernel </span>
       vector_add&lt;&lt;&lt;1,1&gt;&gt;&gt;(d_out, d_a, d_b, N);

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Transfer data back to host memory</span>
  cudaMemcpy(out, d_out, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">float</span>) * N, cudaMemcpyDeviceToHost);

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Verification</span>
  <span style="color: #4f97d7; font-weight: bold;">for</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = 0; i &lt; N; i++){
    assert(fabs(out[i] - a[i] - b[i]) &lt; MAX_ERR);
  }
  printf(<span style="color: #2d9574;">"out[0] = %f\n"</span>, out[0]);
  printf(<span style="color: #2d9574;">"PASSED\n"</span>);

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Deallocate device memory</span>
  cudaFree(d_a);
  cudaFree(d_b);
  cudaFree(d_out);

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Deallocate host memory</span>
  free(a); 
  free(b); 
  free(out);
}

</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">cd</span> babel
nvcc gpu_vector_add_withoutpara.cu -o gpu_vector_add_withoutpara
./gpu_vector_add_withoutpara
</pre>
</div>

<pre class="example">
out[0] = 3.000000
PASSED
</pre>
</div>
</div>
