Parallelisum.org
*** dim 1, grid x, block 256
#+begin_src C :tangle ./babel/gpu_vector_add_dim1_gridx_block256.cu
  #include <stdio.h>
  #include <stdlib.h>
  #include <math.h>
  #include <assert.h>
  #include <cuda.h>
  #include <cuda_runtime.h>

  #define N 1000000
  #define MAX_ERR 1e-6

  __global__ void vector_add(float *out, float *a, float *b, int n) {
    int tid = blockIdx.y * blockDim.x + threadIdx.x;
    int stride = blockDim.x;

    // Handling arbitrary vector size
    for(int i = tid; i < n; i += stride){
      if (i < N){
        out[i] = a[i] + b[i];
      }
    }
  }

  int main(){
    float *a, *b, *out;
    float *d_a, *d_b, *d_out; 

    // Allocate host memory
    a   = (float*)malloc(sizeof(float) * N);
    b   = (float*)malloc(sizeof(float) * N);
    out = (float*)malloc(sizeof(float) * N);

    // Initialize host arrays
    for(int i = 0; i < N; i++){
      a[i] = 1.0f;
      b[i] = 2.0f;
    }

    // Allocate device memory 
    cudaMalloc((void**)&d_a, sizeof(float) * N);
    cudaMalloc((void**)&d_b, sizeof(float) * N);
    cudaMalloc((void**)&d_out, sizeof(float) * N);

    // Transfer data from host to device memory
    cudaMemcpy(d_a, a, sizeof(float) * N, cudaMemcpyHostToDevice);
    cudaMemcpy(d_b, b, sizeof(float) * N, cudaMemcpyHostToDevice);


    // Executing kernel 
    int block_size = 256;
    int grid_size = ((N + block_size) / block_size);
    vector_add<<<grid_size, block_size>>>(d_out, d_a, d_b, N);

    // Transfer data back to host memory
    cudaMemcpy(out, d_out, sizeof(float) * N, cudaMemcpyDeviceToHost);

    // Verification
    for(int i = 0; i < N; i++){
      assert(fabs(out[i] - a[i] - b[i]) < MAX_ERR);
    }

    printf("PASSED\n");

    // Deallocate device memory
    cudaFree(d_a);
    cudaFree(d_b);
    cudaFree(d_out);

    // Deallocate host memory
    free(a); 
    free(b); 
    free(out);
  }
#+end_src
#+begin_src sh :results output :exports both
  cd babel
  nvcc gpu_vector_add_dim1_gridx_block256.cu -o gpu_vector_add_dim1_gridx_block256
  ./gpu_vector_add_dim1_gridx_block256
#+end_src

#+RESULTS:
: PASSED


** Addition dim 2 arry in GPU
*** dim 2, grid 1, block NxN for array
#+begin_src C :tangle ./babel/gpu_vector_add_dim2_grid1_blockNxN.cu
  #include <stdio.h>
  #include <cuda.h>
  #include <assert.h>
  #include <cuda_runtime.h>
  #include <curand_kernel.h>
  #define N 512
  __global__ void add(int *a, int *b, int *c){
    int tid = threadIdx.x + threadIdx.y*blockDim.x + blockDim.x*blockDim.y*blockIdx.x; 
    if(tid < N)
      c[tid] = a[tid] + b[tid];
  }
  int main()
  {
    int a[N], b[N], c[N], i;
    int *dev_a, *dev_b, *dev_c;
    cudaMalloc((void**)&dev_c, N*sizeof(int));
    cudaMalloc((void**)&dev_b, N*sizeof(int));
    cudaMalloc((void**)&dev_a, N*sizeof(int));
    for(i=0; i < N; i++)
      {
        a[i] = 1;
        b[i] = 2;
      }
    cudaMemcpy(dev_a, a, N*sizeof(int), cudaMemcpyHostToDevice);
    cudaMemcpy(dev_b, b, N*sizeof(int), cudaMemcpyHostToDevice);
    dim3 BlockPerGrid(1, 1, 1);
    dim3 ThreadsPerBlock(128, 4, 1);
    add <<< BlockPerGrid, ThreadsPerBlock >>>(dev_a, dev_b, dev_c);
    cudaMemcpy(c, dev_c, N*sizeof(int), cudaMemcpyDeviceToHost);
    for(i=0; i < N; i++){
      assert(a[i] + b[i] == c[i]);
    }
    printf("Passed\n");
    cudaFree(dev_c);
    cudaFree(dev_b);
    cudaFree(dev_a);
    return 0;
  }



#+end_src
#+begin_src sh :results output :exports both
  cd babel
  nvcc gpu_vector_add_dim2_grid1_blockNxN.cu -o gpu_vector_add_dim2_grid1_blockNxN
  ./gpu_vector_add_dim2_grid1_blockNxN
#+end_src

#+RESULTS:
: Passed

