html/Parallelisum.html

<div id="outline-container-org2b30a8d" class="outline-4">
<h4 id="org2b30a8d"><span class="section-number-4">10.2.6.</span> dim 1, grid x, block 256</h4>
<div class="outline-text-4" id="text-10-2-6">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdio.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdlib.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;math.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;assert.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;cuda.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;cuda_runtime.h&gt;</span>

<span style="color: #bc6ec5;">#define</span> <span style="color: #7590db;">N</span> 1000000
<span style="color: #bc6ec5;">#define</span> <span style="color: #7590db;">MAX_ERR</span> 1e-6

__global__ <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">vector_add</span>(<span style="color: #ce537a; font-weight: bold;">float</span> *<span style="color: #7590db;">out</span>, <span style="color: #ce537a; font-weight: bold;">float</span> *<span style="color: #7590db;">a</span>, <span style="color: #ce537a; font-weight: bold;">float</span> *<span style="color: #7590db;">b</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">n</span>) {
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">tid</span> = blockIdx.y * blockDim.x + threadIdx.x;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">stride</span> = blockDim.x;

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Handling arbitrary vector size</span>
  <span style="color: #4f97d7; font-weight: bold;">for</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = tid; i &lt; n; i += stride){
    <span style="color: #4f97d7; font-weight: bold;">if</span> (i &lt; N){
      out[i] = a[i] + b[i];
    }
  }
}

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(){
  <span style="color: #ce537a; font-weight: bold;">float</span> *<span style="color: #7590db;">a</span>, *<span style="color: #7590db;">b</span>, *<span style="color: #7590db;">out</span>;
  <span style="color: #ce537a; font-weight: bold;">float</span> *<span style="color: #7590db;">d_a</span>, *<span style="color: #7590db;">d_b</span>, *<span style="color: #7590db;">d_out</span>; 

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Allocate host memory</span>
  a   = (<span style="color: #ce537a; font-weight: bold;">float</span>*)malloc(<span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">float</span>) * N);
  b   = (<span style="color: #ce537a; font-weight: bold;">float</span>*)malloc(<span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">float</span>) * N);
  out = (<span style="color: #ce537a; font-weight: bold;">float</span>*)malloc(<span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">float</span>) * N);

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Initialize host arrays</span>
  <span style="color: #4f97d7; font-weight: bold;">for</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = 0; i &lt; N; i++){
    a[i] = 1.0f;
    b[i] = 2.0f;
  }

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Allocate device memory </span>
  cudaMalloc((<span style="color: #ce537a; font-weight: bold;">void</span>**)&amp;d_a, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">float</span>) * N);
  cudaMalloc((<span style="color: #ce537a; font-weight: bold;">void</span>**)&amp;d_b, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">float</span>) * N);
  cudaMalloc((<span style="color: #ce537a; font-weight: bold;">void</span>**)&amp;d_out, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">float</span>) * N);

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Transfer data from host to device memory</span>
  cudaMemcpy(d_a, a, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">float</span>) * N, cudaMemcpyHostToDevice);
  cudaMemcpy(d_b, b, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">float</span>) * N, cudaMemcpyHostToDevice);


  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Executing kernel </span>
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">block_size</span> = 256;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">grid_size</span> = ((N + block_size) / block_size);
  vector_add&lt;&lt;&lt;grid_size, block_size&gt;&gt;&gt;(d_out, d_a, d_b, N);

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Transfer data back to host memory</span>
  cudaMemcpy(out, d_out, <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">float</span>) * N, cudaMemcpyDeviceToHost);

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Verification</span>
  <span style="color: #4f97d7; font-weight: bold;">for</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = 0; i &lt; N; i++){
    assert(fabs(out[i] - a[i] - b[i]) &lt; MAX_ERR);
  }

  printf(<span style="color: #2d9574;">"PASSED\n"</span>);

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Deallocate device memory</span>
  cudaFree(d_a);
  cudaFree(d_b);
  cudaFree(d_out);

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Deallocate host memory</span>
  free(a); 
  free(b); 
  free(out);
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">cd</span> babel
nvcc gpu_vector_add_dim1_gridx_block256.cu -o gpu_vector_add_dim1_gridx_block256
./gpu_vector_add_dim1_gridx_block256
</pre>
</div>

<pre class="example">
PASSED
</pre>
</div>
</div>
</div>


<div id="outline-container-orgd319af6" class="outline-3">
<h3 id="orgd319af6"><span class="section-number-3">10.3.</span> Addition dim 2 arry in GPU</h3>
<div class="outline-text-3" id="text-10-3">
</div>
<div id="outline-container-org763ce35" class="outline-4">
<h4 id="org763ce35"><span class="section-number-4">10.3.1.</span> dim 2, grid 1, block NxN for array</h4>
<div class="outline-text-4" id="text-10-3-1">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdio.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;cuda.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;assert.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;cuda_runtime.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;curand_kernel.h&gt;</span>
<span style="color: #bc6ec5;">#define</span> <span style="color: #7590db;">N</span> 512
__global__ <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">add</span>(<span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">a</span>, <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">b</span>, <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">c</span>){
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">tid</span> = threadIdx.x + threadIdx.y*blockDim.x + blockDim.x*blockDim.y*blockIdx.x; 
  <span style="color: #4f97d7; font-weight: bold;">if</span>(tid &lt; N)
    c[tid] = a[tid] + b[tid];
}
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>()
{
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">a</span>[N], <span style="color: #7590db;">b</span>[N], <span style="color: #7590db;">c</span>[N], <span style="color: #7590db;">i</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">dev_a</span>, *<span style="color: #7590db;">dev_b</span>, *<span style="color: #7590db;">dev_c</span>;
  cudaMalloc((<span style="color: #ce537a; font-weight: bold;">void</span>**)&amp;dev_c, N*<span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>));
  cudaMalloc((<span style="color: #ce537a; font-weight: bold;">void</span>**)&amp;dev_b, N*<span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>));
  cudaMalloc((<span style="color: #ce537a; font-weight: bold;">void</span>**)&amp;dev_a, N*<span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>));
  <span style="color: #4f97d7; font-weight: bold;">for</span>(i=0; i &lt; N; i++)
    {
      a[i] = 1;
      b[i] = 2;
    }
  cudaMemcpy(dev_a, a, N*<span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>), cudaMemcpyHostToDevice);
  cudaMemcpy(dev_b, b, N*<span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>), cudaMemcpyHostToDevice);
  <span style="color: #ce537a; font-weight: bold;">dim3</span> <span style="color: #bc6ec5; font-weight: bold;">BlockPerGrid</span>(1, 1, 1);
  <span style="color: #ce537a; font-weight: bold;">dim3</span> <span style="color: #bc6ec5; font-weight: bold;">ThreadsPerBlock</span>(128, 4, 1);
  add &lt;&lt;&lt; BlockPerGrid, ThreadsPerBlock &gt;&gt;&gt;(dev_a, dev_b, dev_c);
  cudaMemcpy(c, dev_c, N*<span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>), cudaMemcpyDeviceToHost);
  <span style="color: #4f97d7; font-weight: bold;">for</span>(i=0; i &lt; N; i++){
    assert(a[i] + b[i] == c[i]);
  }
  printf(<span style="color: #2d9574;">"Passed\n"</span>);
  cudaFree(dev_c);
  cudaFree(dev_b);
  cudaFree(dev_a);
  <span style="color: #4f97d7; font-weight: bold;">return</span> 0;
}



</pre>
</div>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">cd</span> babel
nvcc gpu_vector_add_dim2_grid1_blockNxN.cu -o gpu_vector_add_dim2_grid1_blockNxN
./gpu_vector_add_dim2_grid1_blockNxN
</pre>
</div>

<pre class="example">
Passed
</pre>
</div>
</div>
